<?xml version='1.0' encoding='utf-8'?>
<rss version="2.0">
  <channel>
    <title>GEOMEGA — Merged Press Releases (Newsfile + GlobeNewswire)</title>
    <link>https://www.geomega.ca/</link>
    <description>Merged feed combining Newsfile and GlobeNewswire results for Geomega.</description>
    <lastBuildDate>Wed, 29 Oct 2025 13:37:26 +0000</lastBuildDate>
    <item>
      <title>Géoméga annonce les résultats de son assemblée annuelle, une refonte de son image corporative et l'octroi d'incitatifs à base d'actions</title>
      <link>https://www.newsfilecorp.com/release/271584/Gomga-annonce-les-rsultats-de-son-assemble-annuelle-une-refonte-de-son-image-corporative-et-loctroi-dincitatifs-base-dactions</link>
      <guid>https://www.newsfilecorp.com/release/271584/Gomga-annonce-les-rsultats-de-son-assemble-annuelle-une-refonte-de-son-image-corporative-et-loctroi-dincitatifs-base-dactions</guid>
      <pubDate>Thu, 23 Oct 2025 12:00:00 +0000</pubDate>
      <description>&amp;lt;p&amp;gt;Montréal, Québec--(Newsfile Corp. - 23 octobre 2025) - Ressources G&amp;amp;#233;om&amp;amp;#233;ga inc.&amp;amp;#160;(TSXV: GMA)&amp;amp;#160;(&amp;amp;#171; &amp;lt;b&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga&amp;lt;/b&amp;gt; &amp;amp;#187; ou la &amp;amp;#171; &amp;lt;b&amp;gt;Soci&amp;amp;#233;t&amp;amp;#233;&amp;lt;/b&amp;gt; &amp;amp;#187;) est heureuse d&amp;#x27;annoncer l&amp;#x27;approbation par les actionnaires de l&amp;#x27;ensemble des r&amp;amp;#233;solutions pr&amp;amp;#233;sent&amp;amp;#233;es lors de l&amp;#x27;assembl&amp;amp;#233;e g&amp;amp;#233;n&amp;amp;#233;rale et extraordinaire annuelle des actionnaires tenue le 22 octobre 2025 (l&amp;#x27;&amp;amp;#171; Assembl&amp;amp;#233;e &amp;amp;#187;), ainsi que le d&amp;amp;#233;voilement d&amp;#x27;une nouvelle identit&amp;amp;#233; de marque corporative et l&amp;#x27;octroi d&amp;#x27;incitatifs &amp;amp;#224; base d&amp;#x27;actions en vertu du r&amp;amp;#233;gime incitatif omnibus.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;R&amp;amp;#233;sultats de l&amp;#x27;Assembl&amp;amp;#233;e annuelle&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Toutes les r&amp;amp;#233;solutions pr&amp;amp;#233;sent&amp;amp;#233;es &amp;amp;#224; l&amp;#x27;Assembl&amp;amp;#233;e ont &amp;amp;#233;t&amp;amp;#233; adopt&amp;amp;#233;es par les actionnaires. Celles-ci comprenaient la nomination des administrateurs et des auditeurs, ainsi que le renouvellement du plan incitatif global.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;M. Kiril Mugerman, M. Kosta Kostic, M. Matthew Silvestro, M. Nicholas Nickoletopoulos et Mme Genevi&amp;amp;#232;ve Ayotte ont &amp;amp;#233;t&amp;amp;#233; &amp;amp;#233;lus au conseil d&amp;#x27;administration (le &amp;amp;#171; Conseil &amp;amp;#187;).&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Le cabinet Raymond Chabot Grant Thornton S.E.N.C.R.L. a &amp;amp;#233;t&amp;amp;#233; renomm&amp;amp;#233; &amp;amp;#224; titre d&amp;#x27;auditeur de la Soci&amp;amp;#233;t&amp;amp;#233;.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;amp;#192; la suite de l&amp;#x27;Assembl&amp;amp;#233;e, le Conseil a confirm&amp;amp;#233; les nominations suivantes :&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;Mme Ayotte &amp;amp;#224; titre de pr&amp;amp;#233;sidente du comit&amp;amp;#233; d&amp;#x27;audit, accompagn&amp;amp;#233;e de M. Nickoletopoulos et M. Silvestro ;&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;M. Silvestro &amp;amp;#224; titre de pr&amp;amp;#233;sident du comit&amp;amp;#233; de gouvernance, accompagn&amp;amp;#233; de M. Nickoletopoulos et M. Kostic.&amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;Le Conseil a &amp;amp;#233;galement renomm&amp;amp;#233; M. Kiril Mugerman &amp;amp;#224; titre de pr&amp;amp;#233;sident et chef de la direction, M. Pouya Hajiani &amp;amp;#224; titre de chef de la direction technologique, et M. Mathieu Bourdeau &amp;amp;#224; titre de chef des finances.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Refonte de l&amp;#x27;image corporative - Une nouvelle phase pour G&amp;amp;#233;om&amp;amp;#233;ga&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;amp;#192; l&amp;#x27;occasion de son assembl&amp;amp;#233;e annuelle, G&amp;amp;#233;om&amp;amp;#233;ga est fi&amp;amp;#232;re de pr&amp;amp;#233;senter son nouveau logo corporatif et son site Web modernis&amp;amp;#233;, marquant le d&amp;amp;#233;but d&amp;#x27;un chapitre tournant dans son &amp;amp;#233;volution vers la concr&amp;amp;#233;tisation de son mod&amp;amp;#232;le commercial et la g&amp;amp;#233;n&amp;amp;#233;ration de revenus &amp;amp;#224; partir de ses technologies propres.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Cette refonte incarne la transformation de G&amp;amp;#233;om&amp;amp;#233;ga - d&amp;#x27;une pionni&amp;amp;#232;re en recherche sur l&amp;#x27;extraction des terres rares &amp;amp;#224; une soci&amp;amp;#233;t&amp;amp;#233; engag&amp;amp;#233;e dans la commercialisation de technologies innovantes de recyclage et de m&amp;amp;#233;tallurgie. Sa nouvelle identit&amp;amp;#233; visuelle, centr&amp;amp;#233;e sur un motif circulaire vert dynamique, repr&amp;amp;#233;sente &amp;amp;#224; la fois le renouvellement et la circularit&amp;amp;#233;, en &amp;amp;#233;cho &amp;amp;#224; la mission de la Soci&amp;amp;#233;t&amp;amp;#233; : boucler la boucle dans la r&amp;amp;#233;cup&amp;amp;#233;ration durable des m&amp;amp;#233;taux critiques. La fl&amp;amp;#232;che int&amp;amp;#233;gr&amp;amp;#233;e symbolise la progression, la pr&amp;amp;#233;cision et la durabilit&amp;amp;#233;, des valeurs fondamentales qui guident G&amp;amp;#233;om&amp;amp;#233;ga depuis sa cr&amp;amp;#233;ation.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Cette nouvelle identit&amp;amp;#233; est lanc&amp;amp;#233;e alors que G&amp;amp;#233;om&amp;amp;#233;ga vient de signer son premier contrat de licence technologique (voir &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/rp5PyS87xP&amp;quot;&amp;gt;communiqu&amp;amp;#233; du 8 octobre 2025&amp;lt;/a&amp;gt;), une &amp;amp;#233;tape marquante qui vient valider plusieurs ann&amp;amp;#233;es de recherche et d&amp;amp;#233;veloppement et annonce le d&amp;amp;#233;but d&amp;#x27;un nouveau cycle de croissance ax&amp;amp;#233; sur l&amp;#x27;expansion des partenariats, la g&amp;amp;#233;n&amp;amp;#233;ration de redevances et le d&amp;amp;#233;ploiement mondial de ses technologies propri&amp;amp;#233;taires.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;amp;#171; Notre nouvelle image est bien plus qu&amp;#x27;un simple design - c&amp;#x27;est une d&amp;amp;#233;claration de ce que nous sommes en train de devenir, &amp;amp;#187; a d&amp;amp;#233;clar&amp;amp;#233; Kiril Mugerman, pr&amp;amp;#233;sident et chef de la direction de G&amp;amp;#233;om&amp;amp;#233;ga. &amp;amp;#171; Elle refl&amp;amp;#232;te notre &amp;amp;#233;volution vers une organisation commerciale qui cr&amp;amp;#233;e des retomb&amp;amp;#233;es concr&amp;amp;#232;tes gr&amp;amp;#226;ce &amp;amp;#224; des technologies propres. Le cercle vert incarne l&amp;#x27;essence m&amp;amp;#234;me de notre mission : redonner vie aux m&amp;amp;#233;taux critiques tout en r&amp;amp;#233;duisant les rebuts et les &amp;amp;#233;missions. &amp;amp;#187;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Le nouveau logo et le site Web modernis&amp;amp;#233; pr&amp;amp;#233;sentent une identit&amp;amp;#233; simplifi&amp;amp;#233;e et r&amp;amp;#233;solument tourn&amp;amp;#233;e vers l&amp;#x27;avenir, en harmonie avec la mission environnementale et le leadership technologique de G&amp;amp;#233;om&amp;amp;#233;ga. Les visiteurs sont invit&amp;amp;#233;s &amp;amp;#224; d&amp;amp;#233;couvrir cette nouvelle image et l&amp;#x27;exp&amp;amp;#233;rience visuelle renouvel&amp;amp;#233;e sur &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/VvqxXtPJ4e&amp;quot;&amp;gt;www.geomega.ca&amp;lt;/a&amp;gt;.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Octroi d&amp;#x27;incitatifs &amp;amp;#224; base d&amp;#x27;actions&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Le Conseil a approuv&amp;amp;#233; l&amp;#x27;octroi annuel d&amp;#x27;incitatifs &amp;amp;#224; base d&amp;#x27;actions &amp;amp;#224; ses employ&amp;amp;#233;s, administrateurs, dirigeants et consultants dans le cadre du r&amp;amp;#233;gime incitatif omnibus de la Soci&amp;amp;#233;t&amp;amp;#233;. Les attributions suivantes ont &amp;amp;#233;t&amp;amp;#233; octroy&amp;amp;#233;es:&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;Options d&amp;#x27;achat d&amp;#x27;actions (&amp;amp;#171; Options &amp;amp;#187;) : un total de 1 675 000 Options ont &amp;amp;#233;t&amp;amp;#233; &amp;amp;#233;mises aux employ&amp;amp;#233;s et consultants &amp;amp;#224; un prix d&amp;#x27;exercice de 0,335 $, venant &amp;amp;#224; &amp;amp;#233;ch&amp;amp;#233;ance apr&amp;amp;#232;s cinq ans. Les Options acqui&amp;amp;#232;rent leurs droits sur trois ans, soit 25 % lors des deux premi&amp;amp;#232;res ann&amp;amp;#233;es et 50 % lors de la derni&amp;amp;#232;re ann&amp;amp;#233;e.&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Unit&amp;amp;#233;s d&amp;#x27;actions diff&amp;amp;#233;r&amp;amp;#233;es (&amp;amp;#171; UADs &amp;amp;#187;) : un total de 326 000 UADs ont &amp;amp;#233;t&amp;amp;#233; &amp;amp;#233;mises aux membres du conseil d&amp;#x27;administration. Les droits aux UADs sont acquis un an apr&amp;amp;#232;s la date d&amp;#x27;attribution.&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Unit&amp;amp;#233;s d&amp;#x27;actions restreintes (&amp;amp;#171; UARs &amp;amp;#187;) : un total de 300 000 UARs ont &amp;amp;#233;t&amp;amp;#233; &amp;amp;#233;mises aux dirigeants de la Soci&amp;amp;#233;t&amp;amp;#233;. Les droits aux UARs sont acquis sur deux ans et peuvent &amp;amp;#234;tre r&amp;amp;#233;gl&amp;amp;#233;es apr&amp;amp;#232;s trois ans.&amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;&amp;amp;#192; propos de Geomega (&amp;lt;/b&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/zA8Nxu82O8&amp;quot;&amp;gt;&amp;lt;b&amp;gt;www.geomega.ca&amp;lt;/b&amp;gt;&amp;lt;/a&amp;gt;&amp;lt;b&amp;gt;)&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga d&amp;amp;#233;veloppe des technologies innovantes pour l&amp;#x27;extraction et la s&amp;amp;#233;paration des &amp;amp;#233;l&amp;amp;#233;ments des terres rares et d&amp;#x27;autres m&amp;amp;#233;taux critiques essentiels pour un avenir durable. G&amp;amp;#233;om&amp;amp;#233;ga travaille avec diff&amp;amp;#233;rentes sources d&amp;#x27;approvisionnement pour appliquer ses technologies de valorisation des r&amp;amp;#233;sidus. Cela comprend le recyclage des aimants NdFeB, la valorisation des r&amp;amp;#233;sidus de bauxite et le traitement des r&amp;amp;#233;sidus sulfur&amp;amp;#233;s. La strat&amp;amp;#233;gie de G&amp;amp;#233;om&amp;amp;#233;ga consiste &amp;amp;#224; r&amp;amp;#233;duire progressivement les risques li&amp;amp;#233;s &amp;amp;#224; sa technologie innovante et &amp;amp;#224; g&amp;amp;#233;n&amp;amp;#233;rer des flux de tr&amp;amp;#233;sorerie et un retour de valeur aux actionnaires tout en travaillant directement avec les principaux acteurs de leurs industries respectives.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Alors que ses technologies sont d&amp;amp;#233;montr&amp;amp;#233;es &amp;amp;#224; plus grande &amp;amp;#233;chelle, G&amp;amp;#233;om&amp;amp;#233;ga s&amp;#x27;est engag&amp;amp;#233; &amp;amp;#224; travailler avec des partenaires majeurs pour aider &amp;amp;#224; extraire de la valeur des produits provenant de l&amp;#x27;extraction mini&amp;amp;#232;re, des r&amp;amp;#233;sidus miniers et d&amp;#x27;autres r&amp;amp;#233;sidus industriels qui contiennent des terres rares et d&amp;#x27;autres m&amp;amp;#233;taux critiques. Ind&amp;amp;#233;pendamment du m&amp;amp;#233;tal ou de la source, G&amp;amp;#233;om&amp;amp;#233;ga adopte une approche coh&amp;amp;#233;rente pour r&amp;amp;#233;duire l&amp;#x27;impact environnemental et contribuer &amp;amp;#224; r&amp;amp;#233;duire les &amp;amp;#233;missions de gaz &amp;amp;#224; effet de serre en recyclant les principaux r&amp;amp;#233;actifs du proc&amp;amp;#233;d&amp;amp;#233;.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga est &amp;amp;#233;galement propri&amp;amp;#233;taire du gisement de terres rares de la Carbonatite de Montviel, la plus grande estimation des ressources de bastna&amp;amp;#233;site 43-101 en Am&amp;amp;#233;rique du Nord et d&amp;amp;#233;tient plus de 16,8 millions d&amp;#x27;actions, de Kintavar Exploration Inc. (KTR.V), une soci&amp;amp;#233;t&amp;amp;#233; d&amp;#x27;exploration mini&amp;amp;#232;re qui d&amp;amp;#233;veloppe des projets aurif&amp;amp;#232;res et cuprif&amp;amp;#232;res au Qu&amp;amp;#233;bec, Canada.&amp;lt;/p&amp;gt;&amp;lt;div id=&amp;quot;contactInfo&amp;quot;&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Pour plus de d&amp;amp;#233;tails, contactez:&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p style=&amp;quot;margin-left: 20px;&amp;quot;&amp;gt;Kiril Mugerman&amp;lt;br /&amp;gt;Pr&amp;amp;#233;sident &amp;amp;#38; CEO&amp;lt;br /&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga&amp;lt;br /&amp;gt;514-223-1449 ext. 3&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:kmugerman@Geomega.ca&amp;quot;&amp;gt;kmugerman@Geomega.ca&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;&amp;lt;br /&amp;gt;X: @Geomega_REE&amp;lt;/p&amp;gt;&amp;lt;/div&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Mises en garde concernant les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs &amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;La Bourse de croissance TSX et son fournisseur de services de r&amp;amp;#233;glementation (au sens attribu&amp;amp;#233; &amp;amp;#224; ce terme dans les politiques de la Bourse de croissance TSX) n&amp;#x27;assument aucune responsabilit&amp;amp;#233; &amp;amp;#224; l&amp;#x27;&amp;amp;#233;gard de la pertinence ou de l&amp;#x27;exactitude du pr&amp;amp;#233;sent communiqu&amp;amp;#233;.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;Ce communiqu&amp;amp;#233; de presse peut contenir de l&amp;#x27;information prospective ou des &amp;amp;#233;nonc&amp;amp;#233;s prospectifs au sens des lois sur les valeurs mobili&amp;amp;#232;res canadiennes applicables. L&amp;#x27;information prospective et les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs peuvent inclure entre autres, des &amp;amp;#233;nonc&amp;amp;#233;s relatifs aux projets, les co&amp;amp;#251;ts, les objectifs et la performance de la Soci&amp;amp;#233;t&amp;amp;#233;, ou des hypoth&amp;amp;#232;ses relatives &amp;amp;#224; ce qui pr&amp;amp;#233;c&amp;amp;#232;de. Dans ce communiqu&amp;amp;#233; de presse, les termes comme &amp;amp;#171; pouvoir &amp;amp;#187;, &amp;amp;#171; croire &amp;amp;#187;, &amp;amp;#171; s&amp;#x27;attendre &amp;amp;#224; &amp;amp;#187;, &amp;amp;#171; avoir l&amp;#x27;intention &amp;amp;#187;, &amp;amp;#171; planifier &amp;amp;#187;, &amp;amp;#171; pr&amp;amp;#233;voir &amp;amp;#187;, &amp;amp;#171; potentiel &amp;amp;#187;, &amp;amp;#171; projets &amp;amp;#187;, &amp;amp;#171; estimer &amp;amp;#187;, &amp;amp;#171; continuer &amp;amp;#187;, ou des variantes ou des formes n&amp;amp;#233;gatives de tels termes ou encore d&amp;#x27;une terminologie comparable, sont utilis&amp;amp;#233;s pour identifier des &amp;amp;#233;nonc&amp;amp;#233;s prospectifs. Les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs ne devraient pas &amp;amp;#234;tre interpr&amp;amp;#233;t&amp;amp;#233;s comme une garantie des rendements ou r&amp;amp;#233;sultats futurs, et ne devraient pas n&amp;amp;#233;cessairement donner des indications pr&amp;amp;#233;cises concernant le moment qu&amp;#x27;un tel rendement pourra &amp;amp;#234;tre r&amp;amp;#233;alis&amp;amp;#233;. Rien ne garantit que les &amp;amp;#233;v&amp;amp;#232;nements pr&amp;amp;#233;vus dans l&amp;#x27;information prospective de ce communiqu&amp;amp;#233; de presse se concr&amp;amp;#233;tiseront, y compris la commercialisation des technologies mentionn&amp;amp;#233;es ci-dessus, ou, si l&amp;#x27;un ou l&amp;#x27;autre de ces &amp;amp;#233;v&amp;amp;#232;nements se concr&amp;amp;#233;tisent, quels seront les avantages que la Soci&amp;amp;#233;t&amp;amp;#233; en tirera. L&amp;#x27;information prospective et les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs sont bas&amp;amp;#233;s sur l&amp;#x27;information disponible au moment de la diffusion de ce communiqu&amp;amp;#233; de presse et/ou sur les pr&amp;amp;#233;visions faites de bonne foi par la direction, sous r&amp;amp;#233;serve des incertitudes, hypoth&amp;amp;#232;ses et autres facteurs pr&amp;amp;#233;vus ou non dont plusieurs sont ind&amp;amp;#233;pendants de la volont&amp;amp;#233; de la Soci&amp;amp;#233;t&amp;amp;#233;. Ces risques, incertitudes et hypoth&amp;amp;#232;ses incluent sans s&amp;#x27;y limiter, ceux d&amp;amp;#233;crits &amp;amp;#224; la rubrique portant sur les facteurs de risque de la notice annuelle de la Soci&amp;amp;#233;t&amp;amp;#233;, pour l&amp;#x27;exercice termin&amp;amp;#233; le 31 mai 2025, y compris la disponibilit&amp;amp;#233; de mati&amp;amp;#232;res premi&amp;amp;#232;res provenant de tierces parties raisonnablement disponibles pour l&amp;#x27;usine de d&amp;amp;#233;monstration, laquelle est disponible sur SEDAR+ &amp;amp;#224; l&amp;#x27;adresse &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/4YqD3H08zQ&amp;quot;&amp;gt;www.sedarplus.ca&amp;lt;/a&amp;gt;; qui peuvent faire en sorte que les r&amp;amp;#233;sultats, le rendement ou les r&amp;amp;#233;sultats &amp;amp;#224; venir de la Soci&amp;amp;#233;t&amp;amp;#233; soient consid&amp;amp;#233;rablement diff&amp;amp;#233;rents de ceux indiqu&amp;amp;#233;s de fa&amp;amp;#231;on explicite ou implicite dans de tels &amp;amp;#233;nonc&amp;amp;#233;s prospectifs. La Soci&amp;amp;#233;t&amp;amp;#233; n&amp;#x27;entend pas ni ne s&amp;#x27;engage &amp;amp;#224; actualiser ou revoir l&amp;#x27;information prospective ou les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs contenus dans ce communiqu&amp;amp;#233; de presse &amp;amp;#224; la lumi&amp;amp;#232;re de nouveaux renseignements, subs&amp;amp;#233;quents ou autres, sauf dans les cas pr&amp;amp;#233;vus par les lois applicables.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateNewsLogoContainer&amp;quot;&amp;gt;&amp;lt;img alt=&amp;quot;Corporate Logo&amp;quot; id=&amp;quot;corporateNewsLogo&amp;quot; src=&amp;quot;https://images.newsfilecorp.com/files/11749/271584_e0339c83c47709b4_logo.jpg&amp;quot; /&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateLinkBack&amp;quot;&amp;gt;Pour consulter la version originale de ce communiqu&amp;amp;#233; de presse, visitez le &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/jN8EetqYJr&amp;quot;&amp;gt;https://www.newsfilecorp.com/release/271584&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;img height=&amp;quot;2&amp;quot; id=&amp;quot;352&amp;quot; src=&amp;quot;https://api.newsfilecorp.com/newsinfo/271584/352&amp;quot; style=&amp;quot;width: 1px; height: 1px; border: 0px solid;&amp;quot; width=&amp;quot;2&amp;quot; /&amp;gt;

(Source: Newsfile)</description>
    </item>
    <item>
      <title>Geomega Announces Annual Meeting Results, Corporate Rebranding, and Grants Equity Awards</title>
      <link>https://www.newsfilecorp.com/release/271583/Geomega-Announces-Annual-Meeting-Results-Corporate-Rebranding-and-Grants-Equity-Awards</link>
      <guid>https://www.newsfilecorp.com/release/271583/Geomega-Announces-Annual-Meeting-Results-Corporate-Rebranding-and-Grants-Equity-Awards</guid>
      <pubDate>Thu, 23 Oct 2025 12:00:00 +0000</pubDate>
      <description>&amp;lt;p&amp;gt;Montreal, Quebec--(Newsfile Corp. - October 23, 2025) - Geomega Resources Inc.&amp;amp;#160;(TSXV: GMA)&amp;amp;#160;(&amp;quot;&amp;lt;b&amp;gt;Geomega&amp;lt;/b&amp;gt;&amp;quot; or the &amp;quot;&amp;lt;b&amp;gt;Corporation&amp;lt;/b&amp;gt;&amp;quot;) is pleased to announce the approval by the shareholders of all the resolutions set out at the annual special meeting of shareholders held on October 22, 2025, (the &amp;quot;AGM&amp;quot;) the unveiling of a new corporate brand identity, and the grant of certain equity-based awards under its omnibus incentive plan.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Annual Meeting Results&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;All resolutions presented at the AGM were approved by the shareholders. These resolutions included the appointment of directors and auditors, as well as the renewal of the Omnibus Incentive Plan.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Mr. Kiril Mugerman, Mr. Kosta Kostic, Mr. Matthew Silvestro, Mr. Nicholas Nickoletopoulos, and Ms. Genevi&amp;amp;#232;ve Ayotte were elected to the Board of Directors (the &amp;quot;Board&amp;quot;).&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Raymond Chabot Grant Thornton LLP was reappointed as auditor of the Corporation.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Following the AGM, the Board confirmed the following appointments:&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;Ms. Ayotte as Chair of the Audit Committee, joined by Mr. Nickoletopoulos and Mr. Silvestro;&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Mr. Silvestro as Chair of the Governance Committee, joined by Mr. Nickoletopoulos and Mr. Kostic.&amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;The Board also reappointed Mr. Kiril Mugerman as President and Chief Executive Officer, Mr. Pouya Hajiani as Chief Technology Officer, and Mr. Mathieu Bourdeau as Chief Financial Officer.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Corporate Rebranding - A New Phase for Geomega&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;In conjunction with the AGM, Geomega is proud to unveil its new corporate logo and website, marking the beginning of an exciting new chapter in the Company&amp;#x27;s evolution towards becoming a revenue-generating, commercial-stage cleantech enterprise.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;The rebrand embodies Geomega&amp;#x27;s transformation - from pioneering research in rare-earth extraction to the commercialization of innovative recycling and metallurgical technologies. The new visual identity, centered around a dynamic green circular motif, represents both renewal and circularity, echoing the Company&amp;#x27;s mission to close the loop in critical-metal recovery. The integrated arrow design symbolizes progress, precision, and sustainability, core values that have guided Geomega since its inception.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;This new identity arrives as Geomega completes its first technology licensing transaction (see &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/MqOryT3BKW&amp;quot;&amp;gt;press release of October 8, 2025&amp;lt;/a&amp;gt;), a milestone that validates years of R&amp;amp;#38;D and signals the start of a new growth cycle focused on scaling partnerships, generating royalties, and deploying its proprietary technologies globally.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;quot;Our new brand is more than a design - it&amp;#x27;s a declaration of who we&amp;#x27;ve become,&amp;quot; said Kiril Mugerman, President &amp;amp;#38; CEO of Geomega. &amp;quot;It reflects our evolution into a commercial organization that delivers real-world impact through clean technology. The green circle is the essence of what we do - giving new life to critical metals while reducing waste and emissions.&amp;quot;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;The refreshed logo and modernized website showcase a simplified, forward-looking identity that aligns with Geomega&amp;#x27;s environmental mission and technological leadership. Visitors can discover the new brand and visual experience at &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/bgb51sJBOR&amp;quot;&amp;gt;https://www.geomega.ca/&amp;lt;/a&amp;gt;.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Granting of Equity Incentives&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;The Board has granted annual equity-based incentives to its employees, directors, officers and consultants under the Corporation&amp;#x27;s Omnibus Incentive Plan. The following awards were granted:&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;Stock Options (&amp;quot;Options&amp;quot;): a total of 1,675,000 Options were issued to employees and consultants at an exercise price of $0.335 and expiring after five years. The Options vest over three years in increments of 25% in the first two years and 50% in the last year.&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Deferred Share Units (&amp;quot;DSUs&amp;quot;): a total of 326,000 DSUs were issued to members of the Board of Directors, vesting one year after the grant date.&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Restricted Stock Units (&amp;quot;RSUs&amp;quot;): a total of 300,000 RSUs were issued to executive officers of the Corporation. The RSUs vest over two years in equal installments and may be settled after three years.&amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;About Geomega (&amp;lt;/b&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/3KxXkIrAqm&amp;quot;&amp;gt;&amp;lt;b&amp;gt;www.geomega.ca&amp;lt;/b&amp;gt;&amp;lt;/a&amp;gt;&amp;lt;b&amp;gt;)&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega develops innovative technologies for extraction and separation of rare earth elements and other critical metals essential for a sustainable future. Geomega works with various feed streams to apply its technologies to waste valorization. This includes NdFeB magnet recycling, bauxite residue and sulphide tailings processing. Geomega&amp;#x27;s strategy revolves around gradually de-risking its innovative technology and delivering cashflow and return value to shareholders while working directly with the main players in their respective industries.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;As its technologies are demonstrated on larger scales, Geomega is committed to work with major partners to help extract value from mining feeds, tailings and other industrial residues which contain rare earths and other critical metals. Irrespective of the metal or the source, Geomega adopts a consistent approach to reduce the environmental impact and to contribute to lowering greenhouse gases emissions through recycling the major reagents in the process.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega also owns the Montviel rare earth carbonatite deposit, the largest 43-101 bastnaesite resource estimate in North America and holds over 16.8M shares of Kintavar Exploration Inc. (KTR.V), a mineral exploration company that is exploring for copper and gold projects in Quebec, Canada.&amp;lt;/p&amp;gt;&amp;lt;div id=&amp;quot;contactInfo&amp;quot;&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;For further information, please contact:&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Kiril Mugerman&amp;lt;br /&amp;gt;President and CEO&amp;lt;br /&amp;gt;Geomega&amp;lt;br /&amp;gt;514-223-1449 ext.3&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:kmugerman@geomega.ca&amp;quot;&amp;gt;kmugerman@geomega.ca&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;X: @Geomega_REE&amp;lt;/p&amp;gt;&amp;lt;/div&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Cautions Regarding Forward-Looking Statements &amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;This news release contains statements that may constitute &amp;quot;forward-looking information&amp;quot; or &amp;quot;forward-looking statements&amp;quot; within the meaning of applicable Canadian securities legislation. Forward-looking information and statements may include, among others, statements regarding future plans, costs, objectives or performance of the Corporation, or the assumptions underlying any of the foregoing. In this news release, words such as &amp;quot;may&amp;quot;, &amp;quot;would&amp;quot;, &amp;quot;could&amp;quot;, &amp;quot;will&amp;quot;, &amp;quot;likely&amp;quot;, &amp;quot;believe&amp;quot;, &amp;quot;expect&amp;quot;, &amp;quot;anticipate&amp;quot;, &amp;quot;intend&amp;quot;, &amp;quot;plan&amp;quot;, &amp;quot;estimate&amp;quot; &amp;quot;target&amp;quot; and similar words and the negative form thereof are used to identify forward-looking statements. Forward-looking statements should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. No assurance can be given that any events anticipated by the forward-looking information will transpire or occur, including as regards the commercialization of any of the technology referred to above, or if any of them do so, what benefits the Corporation will derive. Forward-looking statements and information are based on information available at the time and/or management&amp;#x27;s good-faith belief with respect to future events and are subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Corporation&amp;#x27;s control. These risks, uncertainties and assumptions include, but are not limited to, those described under &amp;quot;Risk Factors&amp;quot; in the Corporation&amp;#x27;s annual management&amp;#x27;s discussion and analysis for the fiscal year ended May 31, 2025, which is available on SEDAR+ at &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/XEAxzSKzRR&amp;quot;&amp;gt;www.sedarplus.ca&amp;lt;/a&amp;gt;; they could cause actual events or results to differ materially from those projected in any forward-looking statements. The Corporation does not intend, nor does the Corporation undertake any obligation, to update or revise any forward-looking information or statements contained in this news release to reflect subsequent information, events or circumstances or otherwise, except if required by applicable laws.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateNewsLogoContainer&amp;quot;&amp;gt;&amp;lt;img alt=&amp;quot;Corporate Logo&amp;quot; id=&amp;quot;corporateNewsLogo&amp;quot; src=&amp;quot;https://images.newsfilecorp.com/files/11749/271583_09ecb9b074511b3f_logo.jpg&amp;quot; /&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateLinkBack&amp;quot;&amp;gt;To view the source version of this press release, please visit &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/N3RVKIn84y&amp;quot;&amp;gt;https://www.newsfilecorp.com/release/271583&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;img height=&amp;quot;2&amp;quot; id=&amp;quot;352&amp;quot; src=&amp;quot;https://api.newsfilecorp.com/newsinfo/271583/352&amp;quot; style=&amp;quot;width: 1px; height: 1px; border: 0px solid;&amp;quot; width=&amp;quot;2&amp;quot; /&amp;gt;

(Source: Newsfile)</description>
    </item>
    <item>
      <title>Geomega et Rio Tinto signent un accord de codéveloppement et une licence de démonstration sur la technologie de valorisation des résidus de bauxite</title>
      <link>https://www.newsfilecorp.com/release/269637/Geomega-et-Rio-Tinto-signent-un-accord-de-codveloppement-et-une-licence-de-dmonstration-sur-la-technologie-de-valorisation-des-rsidus-de-bauxite</link>
      <guid>https://www.newsfilecorp.com/release/269637/Geomega-et-Rio-Tinto-signent-un-accord-de-codveloppement-et-une-licence-de-dmonstration-sur-la-technologie-de-valorisation-des-rsidus-de-bauxite</guid>
      <pubDate>Wed, 08 Oct 2025 13:28:00 +0000</pubDate>
      <description>&amp;lt;p&amp;gt;Montréal, Québec--(Newsfile Corp. - 8 octobre 2025) - Ressources G&amp;amp;#233;omega inc. (TSXV: GMA) (OTCQB: GOMRF) (&amp;amp;#171; &amp;lt;b&amp;gt;G&amp;amp;#233;omega&amp;lt;/b&amp;gt; &amp;amp;#187; ou la &amp;amp;#171; &amp;lt;b&amp;gt;Soci&amp;amp;#233;t&amp;amp;#233; &amp;lt;/b&amp;gt;&amp;amp;#187;) a le plaisir d&amp;#x27;annoncer que le 19 septembre 2025, sa filiale en propri&amp;amp;#233;t&amp;amp;#233; exclusive, Innord Inc. (&amp;amp;#171; Innord &amp;amp;#187;), a conclu une entente de cod&amp;amp;#233;veloppement (l&amp;#x27;&amp;amp;#171; Entente &amp;amp;#187;) avec Rio Tinto relativement &amp;amp;#224; la technologie de valorisation des r&amp;amp;#233;sidus de bauxite de G&amp;amp;#233;om&amp;amp;#233;ga (la &amp;amp;#171; Technologie &amp;amp;#187;). L&amp;#x27;Entente pr&amp;amp;#233;voit l&amp;#x27;acquisition par Rio Tinto d&amp;#x27;une licence de d&amp;amp;#233;monstration pour les circuits 1 et 2 de la Technologie et couvre les &amp;amp;#233;tudes d&amp;#x27;ing&amp;amp;#233;nierie qui, si elles sont concluantes, pourraient mener &amp;amp;#224; la construction d&amp;#x27;une usine de d&amp;amp;#233;monstration &amp;amp;#224; Saguenay, au Qu&amp;amp;#233;bec.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Conform&amp;amp;#233;ment &amp;amp;#224; l&amp;#x27;Entente, G&amp;amp;#233;om&amp;amp;#233;ga pr&amp;amp;#233;voit recevoir des paiements totalisant 1 400 000 $ en 2025 et 100 000 $ au d&amp;amp;#233;but de 2026, auxquels pourraient s&amp;#x27;ajouter jusqu&amp;#x27;&amp;amp;#224; 3 000 000 $ suppl&amp;amp;#233;mentaires si Rio Tinto choisit d&amp;#x27;aller de l&amp;#x27;avant avec la construction de l&amp;#x27;usine de d&amp;amp;#233;monstration, pour un montant total pouvant atteindre 4 500 000 $.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Cette technologie pourrait potentiellement permettre &amp;amp;#224; Rio Tinto d&amp;#x27;am&amp;amp;#233;liorer l&amp;#x27;empreinte environnementale du raffinage de l&amp;#x27;alumine en r&amp;amp;#233;duisant la quantit&amp;amp;#233; de r&amp;amp;#233;sidus de bauxite g&amp;amp;#233;n&amp;amp;#233;r&amp;amp;#233;s, tout en permettant l&amp;#x27;extraction de minerai de fer de haute puret&amp;amp;#233; (DRI) et de concentr&amp;amp;#233;s de certain min&amp;amp;#233;raux critiques et strat&amp;amp;#233;giques, notamment de titane et d&amp;#x27;&amp;amp;#233;l&amp;amp;#233;ments de terres rares (ETR). G&amp;amp;#233;om&amp;amp;#233;ga fournira l&amp;#x27;ing&amp;amp;#233;nierie de base et assurera un soutien technique tout au long de la r&amp;amp;#233;alisation du projet. G&amp;amp;#233;om&amp;amp;#233;ga r&amp;amp;#233;alisera &amp;amp;#233;galement des essais compl&amp;amp;#233;mentaires en laboratoire pour d&amp;amp;#233;montrer la flexibilit&amp;amp;#233; et la robustesse du proc&amp;amp;#233;d&amp;amp;#233; en utilisant divers r&amp;amp;#233;sidus de bauxite provenant des activit&amp;amp;#233;s de Rio Tinto &amp;amp;#224; travers le monde. G&amp;amp;#233;om&amp;amp;#233;ga conservera les droits sur la propri&amp;amp;#233;t&amp;amp;#233; intellectuelle, tant ant&amp;amp;#233;rieure que subs&amp;amp;#233;quente, relative &amp;amp;#224; la technologie.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;amp;#171; Rio Tinto est impliqu&amp;amp;#233; aupr&amp;amp;#232;s de notre entreprise depuis le tout d&amp;amp;#233;but de ce projet. Son soutien constant &amp;amp;#224; chaque &amp;amp;#233;tape, de l&amp;#x27;&amp;amp;#233;tude pr&amp;amp;#233;liminaire &amp;amp;#224; la phase pilote et maintenant &amp;amp;#224; la d&amp;amp;#233;monstration, souligne le potentiel durable de notre technologie. Nous sommes ravis de franchir cette &amp;amp;#233;tape majeure avec Rio Tinto pour d&amp;amp;#233;montrer le potentiel de notre technologie de valorisation des r&amp;amp;#233;sidus de bauxite &amp;amp;#224; plus grande &amp;amp;#233;chelle, avec une &amp;amp;#233;ventuelle mise en &amp;amp;#339;uvre sur site. Il s&amp;#x27;agit d&amp;#x27;une &amp;amp;#233;tape majeure pour G&amp;amp;#233;om&amp;amp;#233;ga vers l&amp;#x27;octroi de licences commerciales pour notre technologie et la concr&amp;amp;#233;tisation de notre vision : devenir un leader en mati&amp;amp;#232;re de redevances technologiques avec une sp&amp;amp;#233;cialisation dans l&amp;#x27;extraction de m&amp;amp;#233;taux critiques en vrac. Ce partenariat souligne surtout la demande croissante de solutions durables pour la gestion des r&amp;amp;#233;sidus industriels et miniers. Outre les avantages environnementaux, la r&amp;amp;#233;cup&amp;amp;#233;ration de min&amp;amp;#233;raux critiques et strat&amp;amp;#233;giques valorisables permet de d&amp;amp;#233;velopper une cha&amp;amp;#238;ne d&amp;#x27;approvisionnement locale fiable et durable.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;En collaborant avec l&amp;#x27;un des plus grands producteurs d&amp;#x27;aluminium au monde, nous avons l&amp;#x27;occasion de d&amp;amp;#233;montrer la robustesse de notre proc&amp;amp;#233;d&amp;amp;#233; et d&amp;#x27;ouvrir la voie &amp;amp;#224; un d&amp;amp;#233;ploiement commercial au Qu&amp;amp;#233;bec, Canada, puis &amp;amp;#224; l&amp;#x27;&amp;amp;#233;chelle mondiale. De plus, ce projet a b&amp;amp;#233;n&amp;amp;#233;fici&amp;amp;#233; d&amp;#x27;un soutien important des gouvernements du Qu&amp;amp;#233;bec et du Canada, qui continuent de d&amp;amp;#233;montrer leur engagement &amp;amp;#224; soutenir l&amp;#x27;innovation canadienne. Gr&amp;amp;#226;ce &amp;amp;#224; ce contexte de R&amp;amp;#38;D favorable, le Qu&amp;amp;#233;bec et le Canada pourraient devenir un chef de file mondial du d&amp;amp;#233;veloppement de technologies durables qui soutiennent la cha&amp;amp;#238;ne d&amp;#x27;approvisionnement en min&amp;amp;#233;raux critiques et l&amp;#x27;&amp;amp;#233;conomie verte &amp;amp;#187;, a comment&amp;amp;#233; Kiril Mugerman, pr&amp;amp;#233;sident et chef de la direction de G&amp;amp;#233;om&amp;amp;#233;ga.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;amp;#171; Depuis quatre ans, les &amp;amp;#233;quipes de recherche, d&amp;#x27;ing&amp;amp;#233;nierie et techniques de G&amp;amp;#233;om&amp;amp;#233;ga et de Rio Tinto collaborent &amp;amp;#224; la validation de la technologie de valorisation des r&amp;amp;#233;sidus de bauxite de G&amp;amp;#233;om&amp;amp;#233;ga, dans le cadre de nos efforts continus pour r&amp;amp;#233;duire l&amp;#x27;empreinte environnementale du raffinage de l&amp;#x27;alumine. Cette nouvelle entente de cod&amp;amp;#233;veloppement trace une voie claire pour d&amp;amp;#233;montrer dans quelle mesure la technologie de G&amp;amp;#233;om&amp;amp;#233;ga peut contribuer &amp;amp;#224; relever l&amp;#x27;un des plus grands d&amp;amp;#233;fis de l&amp;#x27;industrie mondiale de l&amp;#x27;aluminium, avec l&amp;#x27;avantage suppl&amp;amp;#233;mentaire de cr&amp;amp;#233;er de nouvelles sources potentielles de min&amp;amp;#233;raux critiques et strat&amp;amp;#233;giques ici au Canada &amp;amp;#187;, a d&amp;amp;#233;clar&amp;amp;#233; Josette Ross, directrice g&amp;amp;#233;n&amp;amp;#233;rale du Centre de recherche et d&amp;amp;#233;veloppement Arvida de Rio Tinto Aluminium.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;&amp;amp;#192; propos de G&amp;amp;#233;om&amp;amp;#233;ga (&amp;lt;/b&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/XEBxpSKPNM&amp;quot;&amp;gt;&amp;lt;b&amp;gt;www.geomega.ca&amp;lt;/b&amp;gt;&amp;lt;/a&amp;gt;&amp;lt;b&amp;gt;)&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga d&amp;amp;#233;veloppe des technologies innovantes pour l&amp;#x27;extraction et la s&amp;amp;#233;paration des &amp;amp;#233;l&amp;amp;#233;ments des terres rares et d&amp;#x27;autres m&amp;amp;#233;taux critiques essentiels pour un avenir durable. G&amp;amp;#233;om&amp;amp;#233;ga travaille avec diff&amp;amp;#233;rentes sources d&amp;#x27;approvisionnement pour appliquer ses technologies de valorisation des r&amp;amp;#233;sidus. Cela comprend le recyclage des aimants NdFeB, la valorisation des r&amp;amp;#233;sidus de bauxite et le traitement des r&amp;amp;#233;sidus sulfur&amp;amp;#233;s. La strat&amp;amp;#233;gie de G&amp;amp;#233;om&amp;amp;#233;ga consiste &amp;amp;#224; r&amp;amp;#233;duire progressivement les risques li&amp;amp;#233;s &amp;amp;#224; sa technologie innovante et &amp;amp;#224; g&amp;amp;#233;n&amp;amp;#233;rer des flux de tr&amp;amp;#233;sorerie et un retour de valeur aux actionnaires tout en travaillant directement avec les principaux acteurs de leurs industries respectives.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Alors que ses technologies sont d&amp;amp;#233;montr&amp;amp;#233;es &amp;amp;#224; plus grande &amp;amp;#233;chelle, G&amp;amp;#233;om&amp;amp;#233;ga s&amp;#x27;est engag&amp;amp;#233; &amp;amp;#224; travailler avec des partenaires majeurs pour aider &amp;amp;#224; extraire de la valeur des produits provenant de l&amp;#x27;extraction mini&amp;amp;#232;re, des r&amp;amp;#233;sidus miniers et d&amp;#x27;autres r&amp;amp;#233;sidus industriels qui contiennent des terres rares et d&amp;#x27;autres m&amp;amp;#233;taux critiques. Ind&amp;amp;#233;pendamment du m&amp;amp;#233;tal ou de la source, G&amp;amp;#233;om&amp;amp;#233;ga adopte une approche coh&amp;amp;#233;rente pour r&amp;amp;#233;duire l&amp;#x27;impact environnemental et contribuer &amp;amp;#224; r&amp;amp;#233;duire les &amp;amp;#233;missions de gaz &amp;amp;#224; effet de serre en recyclant les principaux r&amp;amp;#233;actifs du proc&amp;amp;#233;d&amp;amp;#233;.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga est &amp;amp;#233;galement propri&amp;amp;#233;taire du gisement de terres rares de la Carbonatite de Montviel, la plus grande estimation des ressources de bastna&amp;amp;#233;site 43-101 en Am&amp;amp;#233;rique du Nord et d&amp;amp;#233;tient plus de 16,8 millions d&amp;#x27;actions, de Kintavar Exploration Inc. (KTR.V), une soci&amp;amp;#233;t&amp;amp;#233; d&amp;#x27;exploration mini&amp;amp;#232;re qui d&amp;amp;#233;veloppe des projets aurif&amp;amp;#232;res et cuprif&amp;amp;#232;res au Qu&amp;amp;#233;bec, Canada.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Pour plus de d&amp;amp;#233;tails, contactez:&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;div id=&amp;quot;contactInfo&amp;quot;&amp;gt;&amp;lt;p style=&amp;quot;margin-left: 20px;&amp;quot;&amp;gt;Kiril Mugerman&amp;lt;br /&amp;gt;Pr&amp;amp;#233;sident &amp;amp;#38; CEO&amp;lt;br /&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga&amp;lt;br /&amp;gt;514-223-1449 ext. 3&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:kmugerman@G&amp;amp;#233;om&amp;amp;#233;ga.ca&amp;quot;&amp;gt;kmugerman@G&amp;amp;#233;om&amp;amp;#233;ga.ca&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p style=&amp;quot;margin-left: 20px;&amp;quot;&amp;gt;Nancy Thompson&amp;lt;br /&amp;gt;Vorticom Public Relations&amp;lt;br /&amp;gt;212-532-2208&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:nancyt@vorticom.com&amp;quot;&amp;gt;nancyt@vorticom.com&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;Twitter: @G&amp;amp;#233;om&amp;amp;#233;ga_REE&amp;lt;/p&amp;gt;&amp;lt;/div&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Mises en garde concernant les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;La Bourse de croissance TSX et son fournisseur de services de r&amp;amp;#233;glementation (au sens attribu&amp;amp;#233; &amp;amp;#224; ce terme dans les politiques de la Bourse de croissance TSX) n&amp;#x27;assument aucune responsabilit&amp;amp;#233; &amp;amp;#224; l&amp;#x27;&amp;amp;#233;gard de la pertinence ou de l&amp;#x27;exactitude du pr&amp;amp;#233;sent communiqu&amp;amp;#233;.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;Ce communiqu&amp;amp;#233; de presse peut contenir de l&amp;#x27;information prospective ou des &amp;amp;#233;nonc&amp;amp;#233;s prospectifs au sens des lois sur les valeurs mobili&amp;amp;#232;res canadiennes applicables. L&amp;#x27;information prospective et les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs peuvent inclure entre autres, des &amp;amp;#233;nonc&amp;amp;#233;s relatifs aux projets, les co&amp;amp;#251;ts, les objectifs et la performance de la Soci&amp;amp;#233;t&amp;amp;#233;, ou des hypoth&amp;amp;#232;ses relatives &amp;amp;#224; ce qui pr&amp;amp;#233;c&amp;amp;#232;de. Dans ce communiqu&amp;amp;#233; de presse, les termes comme &amp;amp;#171; pouvoir &amp;amp;#187;, &amp;amp;#171; croire &amp;amp;#187;, &amp;amp;#171; s&amp;#x27;attendre &amp;amp;#224; &amp;amp;#187;, &amp;amp;#171; avoir l&amp;#x27;intention &amp;amp;#187;, &amp;amp;#171; planifier &amp;amp;#187;, &amp;amp;#171; pr&amp;amp;#233;voir &amp;amp;#187;, &amp;amp;#171; potentiel &amp;amp;#187;, &amp;amp;#171; projets &amp;amp;#187;, &amp;amp;#171; estimer &amp;amp;#187;, &amp;amp;#171; continuer &amp;amp;#187;, ou des variantes ou des formes n&amp;amp;#233;gatives de tels termes ou encore d&amp;#x27;une terminologie comparable, sont utilis&amp;amp;#233;s pour identifier des &amp;amp;#233;nonc&amp;amp;#233;s prospectifs. Les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs ne devraient pas &amp;amp;#234;tre interpr&amp;amp;#233;t&amp;amp;#233;s comme une garantie des rendements ou r&amp;amp;#233;sultats futurs, et ne devraient pas n&amp;amp;#233;cessairement donner des indications pr&amp;amp;#233;cises concernant le moment qu&amp;#x27;un tel rendement pourra &amp;amp;#234;tre r&amp;amp;#233;alis&amp;amp;#233;. Rien ne garantit que les &amp;amp;#233;v&amp;amp;#232;nements pr&amp;amp;#233;vus dans l&amp;#x27;information prospective de ce communiqu&amp;amp;#233; de presse se concr&amp;amp;#233;tiseront, y compris la commercialisation des technologies mentionn&amp;amp;#233;es ci-dessus, ou, si l&amp;#x27;un ou l&amp;#x27;autre de ces &amp;amp;#233;v&amp;amp;#232;nements se concr&amp;amp;#233;tisent, quels seront les avantages que la Soci&amp;amp;#233;t&amp;amp;#233; en tirera. L&amp;#x27;information prospective et les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs sont bas&amp;amp;#233;s sur l&amp;#x27;information disponible au moment de la diffusion de ce communiqu&amp;amp;#233; de presse et/ou sur les pr&amp;amp;#233;visions faites de bonne foi par la direction, sous r&amp;amp;#233;serve des incertitudes, hypoth&amp;amp;#232;ses et autres facteurs pr&amp;amp;#233;vus ou non dont plusieurs sont ind&amp;amp;#233;pendants de la volont&amp;amp;#233; de la Soci&amp;amp;#233;t&amp;amp;#233;. Ces risques, incertitudes et hypoth&amp;amp;#232;ses incluent sans s&amp;#x27;y limiter, ceux d&amp;amp;#233;crits &amp;amp;#224; la rubrique portant sur les facteurs de risque de la notice annuelle de la Soci&amp;amp;#233;t&amp;amp;#233;, pour l&amp;#x27;exercice termin&amp;amp;#233; le 31 mai 2025, y compris la disponibilit&amp;amp;#233; de mati&amp;amp;#232;res premi&amp;amp;#232;res provenant de tierces parties raisonnablement disponibles pour l&amp;#x27;usine de d&amp;amp;#233;monstration, laquelle est disponible sur SEDAR+ &amp;amp;#224; l&amp;#x27;adresse &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/zA7NwH8y7z&amp;quot;&amp;gt;www.sedarplus.ca&amp;lt;/a&amp;gt;; qui peuvent faire en sorte que les r&amp;amp;#233;sultats, le rendement ou les r&amp;amp;#233;sultats &amp;amp;#224; venir de la Soci&amp;amp;#233;t&amp;amp;#233; soient consid&amp;amp;#233;rablement diff&amp;amp;#233;rents de ceux indiqu&amp;amp;#233;s de fa&amp;amp;#231;on explicite ou implicite dans de tels &amp;amp;#233;nonc&amp;amp;#233;s prospectifs. La Soci&amp;amp;#233;t&amp;amp;#233; n&amp;#x27;entend pas ni ne s&amp;#x27;engage &amp;amp;#224; actualiser ou revoir l&amp;#x27;information prospective ou les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs contenus dans ce communiqu&amp;amp;#233; de presse &amp;amp;#224; la lumi&amp;amp;#232;re de nouveaux renseignements, subs&amp;amp;#233;quents ou autres, sauf dans les cas pr&amp;amp;#233;vus par les lois applicables.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateNewsLogoContainer&amp;quot;&amp;gt;&amp;lt;img alt=&amp;quot;Corporate Logo&amp;quot; id=&amp;quot;corporateNewsLogo&amp;quot; src=&amp;quot;https://images.newsfilecorp.com/files/11749/269637_03c635ba347a89e1_logo.jpg&amp;quot; /&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateLinkBack&amp;quot;&amp;gt;To view the source version of this press release, please visit &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/DOBq0tznWn&amp;quot;&amp;gt;https://www.newsfilecorp.com/release/269637&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;img height=&amp;quot;2&amp;quot; id=&amp;quot;352&amp;quot; src=&amp;quot;https://api.newsfilecorp.com/newsinfo/269637/352&amp;quot; style=&amp;quot;width: 1px; height: 1px; border: 0px solid;&amp;quot; width=&amp;quot;2&amp;quot; /&amp;gt;

(Source: Newsfile)</description>
    </item>
    <item>
      <title>Geomega and Rio Tinto Sign a Joint Development Agreement and Demo License on Bauxite Residue Valorization Technology</title>
      <link>https://www.newsfilecorp.com/release/269636/Geomega-and-Rio-Tinto-Sign-a-Joint-Development-Agreement-and-Demo-License-on-Bauxite-Residue-Valorization-Technology</link>
      <guid>https://www.newsfilecorp.com/release/269636/Geomega-and-Rio-Tinto-Sign-a-Joint-Development-Agreement-and-Demo-License-on-Bauxite-Residue-Valorization-Technology</guid>
      <pubDate>Wed, 08 Oct 2025 13:27:00 +0000</pubDate>
      <description>&amp;lt;p&amp;gt;Montreal, Quebec--(Newsfile Corp. - October 8, 2025) - Geomega Resources Inc.&amp;amp;#160;(TSXV: GMA) (OTCQB: GOMRF)&amp;amp;#160;(&amp;quot;&amp;lt;b&amp;gt;Geomega&amp;lt;/b&amp;gt;&amp;quot; or the &amp;quot;&amp;lt;b&amp;gt;Corporation&amp;lt;/b&amp;gt;&amp;quot;) is pleased to announce that on September 19, 2025 its wholly owned subsidiary, Innord Inc. (&amp;quot;Innord&amp;quot;), has entered into a Joint Development Agreement (the &amp;quot;JDA&amp;quot;) with Rio Tinto in connection with Geomega&amp;#x27;s Bauxite Residue Valorization Technology (the &amp;quot;Technology&amp;quot;). The JDA includes Rio Tinto purchasing a demonstration license for Circuit 1 and 2 of the Technology and covers engineering studies, that if successful, could potentially lead to the construction of a demonstration plant in Saguenay, Quebec. &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;As per the JDA, Geomega expects to receive payments totaling $1,400,000 in 2025, $100,000 in early 2026 and then $3,000,000 of potential additional payments, if Rio Tinto decides to move forward with the construction of the demonstration plant, for a total of up to $4,500,000.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;The Technology could potentially allow Rio Tinto to improve the environmental footprint of alumina refining by reducing the amount of bauxite residue stored while allowing the extraction of direct reduced iron (DRI) grade ore and some critical and strategic minerals, such as rare earth element (REE) concentrate and titanium concentrate. Geomega will provide the basic engineering package and will then provide certain engineering support during the execution of this project. Geomega will also carry supporting test work to demonstrate process flexibility and robustness using various bauxite residue feeds from Rio Tinto operations around the world. Geomega will retain ownership of all background and foreground intellectual property related to the Technology.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;quot;Rio Tinto has been involved with our Corporation since the very beginning of this project. Their consistent backing at every stage, from bench scale to piloting and now demonstration, underscores the enduring potential of our technology. We are excited to take this major step forward with Rio Tinto to demonstrate the potential of our Bauxite Residue Valorization Technology at a larger scale with potential on-site implementation. This is a major step for Geomega towards commercial licensing of our Technology and executing on our vision of becoming a leading technology royalties company with focus on critical and bulk metals extraction. Importantly, this partnership highlights the growing demand for sustainable solutions in managing industrial and mining residues. In addition to the environmental benefit, recovering valuable critical and strategic minerals develops a reliable and sustainable local supply chain. &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;By working with one of the world&amp;#x27;s leading aluminium producers, we have the opportunity to demonstrate the robustness of our process and pave the way toward commercial deployment in Quebec, Canada and then globally. In addition, this project saw significant support along the way from the Quebec and Federal governments which both continue to demonstrate their dedication to supporting Canadian innovation. With this favorable R&amp;amp;#38;D environment, Quebec and Canada could become a global leader in developing sustainable technologies that support the critical minerals supply chain and the green economy.&amp;quot; commented Kiril Mugerman, President and CEO of Geomega. &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;quot;For four years, Geomega and Rio Tinto&amp;#x27;s research, engineering and technical teams have been working together to validate Geomega&amp;#x27;s bauxite residue valorization technology, as part of our ongoing efforts to reduce the environmental footprint of alumina refining. This new joint development agreement sets out a clear path to demonstrate to what extent Geomega&amp;#x27;s technology can contribute to address one of the global aluminium industry&amp;#x27;s greatest challenges, with the added benefit of creating potential new sources of critical and strategic minerals here in Canada&amp;quot; said Josette Ross, General Manager of Rio Tinto Aluminium&amp;#x27;s Arvida Research and Development Center.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;About Geomega (&amp;lt;/b&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/DOBqnFznWY&amp;quot;&amp;gt;&amp;lt;b&amp;gt;www.geomega.ca&amp;lt;/b&amp;gt;&amp;lt;/a&amp;gt;&amp;lt;b&amp;gt;)&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega develops innovative technologies for extraction and separation of rare earth elements and other critical metals essential for a sustainable future. Geomega works with various feed streams to apply its technologies to waste valorization. This includes NdFeB magnet recycling, bauxite residue and sulphide tailings processing. Geomega&amp;#x27;s strategy revolves around gradually de-risking its innovative technology and delivering cashflow and return value to shareholders while working directly with the main players in their respective industries.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;As its technologies are demonstrated on larger scales, Geomega is committed to work with major partners to help extract value from mining feeds, tailings and other industrial residues which contain rare earths and other critical metals. Irrespective of the metal or the source, Geomega adopts a consistent approach to reduce the environmental impact and to contribute to lowering greenhouse gases emissions through recycling the major reagents in the process.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega also owns the Montviel rare earth carbonatite deposit, the largest 43-101 bastnaesite resource estimate in North America and holds over 16.8M shares of Kintavar Exploration Inc. (KTR.V), a mineral exploration company that is exploring for copper and gold projects in Quebec, Canada.&amp;lt;/p&amp;gt;&amp;lt;div id=&amp;quot;contactInfo&amp;quot;&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;For further information, please contact:&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Kiril Mugerman&amp;lt;br /&amp;gt;President and CEO&amp;lt;br /&amp;gt;Geomega&amp;lt;br /&amp;gt;514-223-1449 ext. 3&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:kmugerman@geomega.ca&amp;quot;&amp;gt;kmugerman@geomega.ca&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;&amp;lt;br /&amp;gt;Nancy Thompson&amp;lt;br /&amp;gt;Vorticom Public Relations&amp;lt;br /&amp;gt;212-532-2208&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:nancyt@vorticom.com&amp;quot;&amp;gt;nancyt@vorticom.com&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;X: @Geomega_REE&amp;lt;/p&amp;gt;&amp;lt;/div&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Cautions Regarding Forward-Looking Statements &amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;This news release contains statements that may constitute &amp;quot;forward-looking information&amp;quot; or &amp;quot;forward-looking statements&amp;quot; within the meaning of applicable Canadian securities legislation. Forward-looking information and statements may include, among others, statements regarding future plans, costs, objectives or performance of the Corporation, or the assumptions underlying any of the foregoing. In this news release, words such as &amp;quot;may&amp;quot;, &amp;quot;would&amp;quot;, &amp;quot;could&amp;quot;, &amp;quot;will&amp;quot;, &amp;quot;likely&amp;quot;, &amp;quot;believe&amp;quot;, &amp;quot;expect&amp;quot;, &amp;quot;anticipate&amp;quot;, &amp;quot;intend&amp;quot;, &amp;quot;plan&amp;quot;, &amp;quot;estimate&amp;quot; &amp;quot;target&amp;quot; and similar words and the negative form thereof are used to identify forward-looking statements. Forward-looking statements should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. No assurance can be given that any events anticipated by the forward-looking information will transpire or occur, including as regards the commercialization of any of the technology referred to above, or if any of them do so, what benefits the Corporation will derive. Forward-looking statements and information are based on information available at the time and/or management&amp;#x27;s good-faith belief with respect to future events and are subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Corporation&amp;#x27;s control. These risks, uncertainties and assumptions include, but are not limited to, those described under &amp;quot;Risk Factors&amp;quot; in the Corporation&amp;#x27;s annual management&amp;#x27;s discussion and analysis for the fiscal year ended May 31, 2025, which is available on SEDAR+ at www.sedarplus.ca; they could cause actual events or results to differ materially from those projected in any forward-looking statements. The Corporation does not intend, nor does the Corporation undertake any obligation, to update or revise any forward-looking information or statements contained in this news release to reflect subsequent information, events or circumstances or otherwise, except if required by applicable laws.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateNewsLogoContainer&amp;quot;&amp;gt;&amp;lt;img alt=&amp;quot;Corporate Logo&amp;quot; id=&amp;quot;corporateNewsLogo&amp;quot; src=&amp;quot;https://images.newsfilecorp.com/files/11749/269636_a09b59f8346bc9ae_logo.jpg&amp;quot; /&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateLinkBack&amp;quot;&amp;gt;To view the source version of this press release, please visit &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/rpmP1t8qJY&amp;quot;&amp;gt;https://www.newsfilecorp.com/release/269636&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;img height=&amp;quot;2&amp;quot; id=&amp;quot;352&amp;quot; src=&amp;quot;https://api.newsfilecorp.com/newsinfo/269636/352&amp;quot; style=&amp;quot;width: 1px; height: 1px; border: 0px solid;&amp;quot; width=&amp;quot;2&amp;quot; /&amp;gt;

(Source: Newsfile)</description>
    </item>
    <item>
      <title>Geomega Resources Inc. annonce une mise à jour de l'entreprise</title>
      <link>https://www.newsfilecorp.com/release/265963/Geomega-Resources-Inc.-annonce-une-mise-jour-de-lentreprise</link>
      <guid>https://www.newsfilecorp.com/release/265963/Geomega-Resources-Inc.-annonce-une-mise-jour-de-lentreprise</guid>
      <pubDate>Thu, 11 Sep 2025 11:30:00 +0000</pubDate>
      <description>&amp;lt;p&amp;gt;Montreal, Quebec--(Newsfile Corp. - 11 septembre 2025) - Ressources G&amp;amp;#233;omega inc.&amp;amp;#160;(TSXV: GMA) (OTCQB: GOMRF) (&amp;amp;#171; &amp;lt;b&amp;gt;G&amp;amp;#233;omega&amp;lt;/b&amp;gt; &amp;amp;#187; ou la &amp;amp;#171; &amp;lt;b&amp;gt;Soci&amp;amp;#233;t&amp;amp;#233; &amp;lt;/b&amp;gt;&amp;amp;#187;) est heureuse de fournir une mise &amp;amp;#224; jour corporative comprenant les faits saillants suivants :&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;Date de l&amp;#x27;assembl&amp;amp;#233;e g&amp;amp;#233;n&amp;amp;#233;rale annuelle et extraordinaire fix&amp;amp;#233;e au 22 octobre 2025&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Changements au sein du conseil d&amp;#x27;administration&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Conf&amp;amp;#233;rences &amp;amp;#224; venir&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Exercice de titres&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Pr&amp;amp;#233;cision concernant la personne qualifi&amp;amp;#233;e du projet Montviel&amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Assembl&amp;amp;#233;e g&amp;amp;#233;n&amp;amp;#233;rale annuelle et extraordinaire (AGM) 2025&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Ressources G&amp;amp;#233;omega inc. a le plaisir d&amp;#x27;annoncer que son AGM se tiendra le 22 octobre 2025 &amp;amp;#224; 10 h (heure de l&amp;#x27;Est) aux bureaux de Dentons Canada S.E.N.C.R.L. situ&amp;amp;#233;s au 1 Place Ville-Marie, 39e &amp;amp;#233;tage, Montr&amp;amp;#233;al (Qu&amp;amp;#233;bec) H3B 4M7. La Soci&amp;amp;#233;t&amp;amp;#233; se r&amp;amp;#233;jouit de rencontrer ses actionnaires, de partager ses progr&amp;amp;#232;s ainsi que ses perspectives d&amp;#x27;avenir et d&amp;#x27;&amp;amp;#233;changer sur des sujets importants. Les actionnaires sont invit&amp;amp;#233;s &amp;amp;#224; y participer en personne ou par vid&amp;amp;#233;oconf&amp;amp;#233;rence. &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Les actionnaires qui souhaitent assister virtuellement &amp;amp;#224; la r&amp;amp;#233;union peuvent s&amp;#x27;inscrire via le &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/Q2wmzCKXOo&amp;quot;&amp;gt;lien de r&amp;amp;#233;union TEAMS.&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Nous esp&amp;amp;#233;rons vous voir en grand nombre &amp;amp;#224; cette occasion.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Changements au sein du conseil d&amp;#x27;administration lors de l&amp;#x27;AGM&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;La Soci&amp;amp;#233;t&amp;amp;#233; est heureuse d&amp;#x27;annoncer la nomination de Genevi&amp;amp;#232;ve Ayotte, CPA, &amp;amp;#224; son conseil d&amp;#x27;administration. Mme Ayotte, actuellement chef de la direction financi&amp;amp;#232;re de Arianne Phosphate inc., assumera &amp;amp;#233;galement le r&amp;amp;#244;le de pr&amp;amp;#233;sidente du comit&amp;amp;#233; d&amp;#x27;audit. Elle poss&amp;amp;#232;de une vaste expertise en finance, en comptabilit&amp;amp;#233;, en gouvernance et en v&amp;amp;#233;rification, avec notamment plus de 14 ann&amp;amp;#233;es chez PricewaterhouseCoopers S.R.L./s.r.l., o&amp;amp;#249; elle occupait le poste de directrice en audit au bureau de Montr&amp;amp;#233;al et se sp&amp;amp;#233;cialisait aupr&amp;amp;#232;s de soci&amp;amp;#233;t&amp;amp;#233;s publiques et priv&amp;amp;#233;es du secteur minier. Elle a &amp;amp;#233;galement &amp;amp;#233;t&amp;amp;#233; pr&amp;amp;#233;sidente du chapitre montr&amp;amp;#233;alais de Women in Mining pendant plus de cinq ans, jusqu&amp;#x27;en 2024.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;amp;#192; cette occasion, la Soci&amp;amp;#233;t&amp;amp;#233; annonce &amp;amp;#233;galement que M. Gilles Gingras, administrateur et pr&amp;amp;#233;sident du comit&amp;amp;#233; d&amp;#x27;audit, prendra sa retraite du conseil d&amp;#x27;administration apr&amp;amp;#232;s 12 ann&amp;amp;#233;es de service d&amp;amp;#233;vou&amp;amp;#233;. &amp;amp;#171; Au nom de la Soci&amp;amp;#233;t&amp;amp;#233;, je tiens &amp;amp;#224; exprimer notre plus sinc&amp;amp;#232;re gratitude &amp;amp;#224; Gilles pour son leadership, son engagement et ses pr&amp;amp;#233;cieuses contributions au d&amp;amp;#233;veloppement et au succ&amp;amp;#232;s de G&amp;amp;#233;omega &amp;amp;#187;, a d&amp;amp;#233;clar&amp;amp;#233; Kiril Mugerman, pr&amp;amp;#233;sident et chef de la direction. &amp;amp;#171; En parall&amp;amp;#232;le, nous sommes tr&amp;amp;#232;s heureux d&amp;#x27;accueillir Genevi&amp;amp;#232;ve alors que nous poursuivons la strat&amp;amp;#233;gie de croissance de G&amp;amp;#233;omega vers un mod&amp;amp;#232;le d&amp;#x27;affaires ax&amp;amp;#233; sur les redevances technologiques. &amp;amp;#187; a ajout&amp;amp;#233; Mr. Mugerman.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Conf&amp;amp;#233;rences &amp;amp;#224; venir&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;G&amp;amp;#233;omega est ravie d&amp;#x27;annoncer que son &amp;amp;#233;quipe de direction participera et pr&amp;amp;#233;sentera lors des conf&amp;amp;#233;rences &amp;amp;#224; venir suivantes:&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/noQejhkEGB&amp;quot;&amp;gt;ICSOBA 2025&amp;lt;/a&amp;gt; - La 43e conf&amp;amp;#233;rence et exposition du Committee for the Study of Bauxite, Alumina, and Aluminium se tiendra du 26 au 31 octobre 2025 &amp;amp;#224; Nanning, dans la province du Guangxi, en Chine. Le chef de la direction technologique de G&amp;amp;#233;omega, Dr Pouya Hajiani, y pr&amp;amp;#233;sentera une conf&amp;amp;#233;rence intitul&amp;amp;#233;e &amp;lt;i&amp;gt;Waste to Value - Sustainable Valorization of Bauxite Residues&amp;lt;/i&amp;gt;.&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/KLB4WigapA&amp;quot;&amp;gt;IFCURM 2025&amp;lt;/a&amp;gt; - Le International Forum on Comprehensive Utilization of Bauxite Residue aura lieu du 31 octobre au 3 novembre 2025, &amp;amp;#233;galement &amp;amp;#224; Nanning, Guangxi, Chine. &amp;amp;#192; cet &amp;amp;#233;v&amp;amp;#233;nement, G&amp;amp;#233;omega et son partenaire Rio Tinto pr&amp;amp;#233;senteront les travaux r&amp;amp;#233;alis&amp;amp;#233;s dans le cadre de leur projet d&amp;#x27;extraction de min&amp;amp;#233;raux critiques et strat&amp;amp;#233;giques &amp;amp;#224; partir de r&amp;amp;#233;sidus de bauxite.&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/EZvNwCaMJ4&amp;quot;&amp;gt;TMS 2026&amp;lt;/a&amp;gt; - La 155e r&amp;amp;#233;union annuelle et exposition de la Minerals, Metals &amp;amp;#38; Materials Society se d&amp;amp;#233;roulera du 15 au 19 mars 2026 &amp;amp;#224; San Diego, Californie, &amp;amp;#201;tats-Unis. Lors de cet &amp;amp;#233;v&amp;amp;#233;nement, le Dr Pouya Hajiani pr&amp;amp;#233;sentera la technologie durable de valorisation des r&amp;amp;#233;sidus de bauxite d&amp;amp;#233;velopp&amp;amp;#233;e par G&amp;amp;#233;omega.&amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Exercice d&amp;#x27;instruments financiers&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Depuis le d&amp;amp;#233;but de l&amp;#x27;exercice financier en cours (1er juin 2025), la Soci&amp;amp;#233;t&amp;amp;#233; a recueilli plus de 735 060 $ par l&amp;#x27;exercice de divers instruments financiers (bons de souscription et options), entra&amp;amp;#238;nant l&amp;#x27;&amp;amp;#233;mission d&amp;#x27;un total combin&amp;amp;#233; de 5 354 667 actions ordinaires. G&amp;amp;#233;omega continue de b&amp;amp;#233;n&amp;amp;#233;ficier du fort appui de ses principaux actionnaires alors qu&amp;#x27;elle avance la construction de son usine de d&amp;amp;#233;monstration de recyclage des terres rares et son programme de R&amp;amp;#38;D sur la valorisation des r&amp;amp;#233;sidus de bauxite, en vue d&amp;#x27;&amp;amp;#233;voluer vers un mod&amp;amp;#232;le d&amp;#x27;affaires bas&amp;amp;#233; sur l&amp;#x27;octroi de licences.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Pr&amp;amp;#233;cision concernant le communiqu&amp;amp;#233; sur les travaux hydrom&amp;amp;#233;tallurgiques de Montviel&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Le 17 juin 2025, G&amp;amp;#233;omega a publi&amp;amp;#233; une mise &amp;amp;#224; jour sur l&amp;#x27;avancement du proc&amp;amp;#233;d&amp;amp;#233; hydrom&amp;amp;#233;tallurgique de Montviel. Dr Pouya Hajiani agit &amp;amp;#224; titre de chef de la direction technologique de la Soci&amp;amp;#233;t&amp;amp;#233;; toutefois, il n&amp;#x27;est pas une personne qualifi&amp;amp;#233;e (PQ) au sens de l&amp;#x27;article 2.1 de la Norme canadienne 43-101 - &amp;lt;i&amp;gt;Normes de divulgation des projets miniers&amp;lt;/i&amp;gt;. &amp;amp;#192; titre de pr&amp;amp;#233;cision, la personne qualifi&amp;amp;#233;e responsable de l&amp;#x27;examen et de l&amp;#x27;approbation des informations scientifiques et techniques divulgu&amp;amp;#233;es dans le &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/xEgxoFzQ0Y&amp;quot;&amp;gt;communiqu&amp;amp;#233; de presse du 17 juin 2025&amp;lt;/a&amp;gt; est Russell Boehme, ing., qui a r&amp;amp;#233;vis&amp;amp;#233; et approuv&amp;amp;#233; les informations pr&amp;amp;#233;sent&amp;amp;#233;es.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;&amp;amp;#192; propos de G&amp;amp;#233;om&amp;amp;#233;ga (&amp;lt;/b&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/7nMo4F0ZO7&amp;quot;&amp;gt;&amp;lt;b&amp;gt;www.geomega.ca&amp;lt;/b&amp;gt;&amp;lt;/a&amp;gt;&amp;lt;b&amp;gt;)&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga d&amp;amp;#233;veloppe des technologies innovantes pour l&amp;#x27;extraction et la s&amp;amp;#233;paration des &amp;amp;#233;l&amp;amp;#233;ments des terres rares et d&amp;#x27;autres m&amp;amp;#233;taux critiques essentiels pour un avenir durable. G&amp;amp;#233;om&amp;amp;#233;ga travaille avec diff&amp;amp;#233;rentes sources d&amp;#x27;approvisionnement pour appliquer ses technologies de valorisation des r&amp;amp;#233;sidus. Cela comprend le recyclage des aimants NdFeB, la valorisation des r&amp;amp;#233;sidus de bauxite et le traitement des r&amp;amp;#233;sidus sulfur&amp;amp;#233;s. La strat&amp;amp;#233;gie de G&amp;amp;#233;om&amp;amp;#233;ga consiste &amp;amp;#224; r&amp;amp;#233;duire progressivement les risques li&amp;amp;#233;s &amp;amp;#224; sa technologie innovante et &amp;amp;#224; g&amp;amp;#233;n&amp;amp;#233;rer des flux de tr&amp;amp;#233;sorerie et un retour de valeur aux actionnaires tout en travaillant directement avec les principaux acteurs de leurs industries respectives.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Alors que ses technologies sont d&amp;amp;#233;montr&amp;amp;#233;es &amp;amp;#224; plus grande &amp;amp;#233;chelle, G&amp;amp;#233;om&amp;amp;#233;ga s&amp;#x27;est engag&amp;amp;#233; &amp;amp;#224; travailler avec des partenaires majeurs pour aider &amp;amp;#224; extraire de la valeur des produits provenant de l&amp;#x27;extraction mini&amp;amp;#232;re, des r&amp;amp;#233;sidus miniers et d&amp;#x27;autres r&amp;amp;#233;sidus industriels qui contiennent des terres rares et d&amp;#x27;autres m&amp;amp;#233;taux critiques. Ind&amp;amp;#233;pendamment du m&amp;amp;#233;tal ou de la source, G&amp;amp;#233;om&amp;amp;#233;ga adopte une approche coh&amp;amp;#233;rente pour r&amp;amp;#233;duire l&amp;#x27;impact environnemental et contribuer &amp;amp;#224; r&amp;amp;#233;duire les &amp;amp;#233;missions de gaz &amp;amp;#224; effet de serre en recyclant les principaux r&amp;amp;#233;actifs du proc&amp;amp;#233;d&amp;amp;#233;.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga est &amp;amp;#233;galement propri&amp;amp;#233;taire du gisement de terres rares de la Carbonatite de Montviel, la plus grande estimation des ressources de bastna&amp;amp;#233;site 43-101 en Am&amp;amp;#233;rique du Nord et d&amp;amp;#233;tient plus de 16,8 millions d&amp;#x27;actions, repr&amp;amp;#233;sentant environ 13% des actions &amp;amp;#233;mises et en circulation, de Kintavar Exploration Inc. (KTR.V), une soci&amp;amp;#233;t&amp;amp;#233; d&amp;#x27;exploration mini&amp;amp;#232;re qui d&amp;amp;#233;veloppe des projets cuprif&amp;amp;#232;res au Qu&amp;amp;#233;bec, Canada.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Pour plus de d&amp;amp;#233;tails, contactez:&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;div id=&amp;quot;contactInfo&amp;quot;&amp;gt;&amp;lt;p style=&amp;quot;margin-left: 20px;&amp;quot;&amp;gt;Kiril Mugerman&amp;lt;br /&amp;gt;Pr&amp;amp;#233;sident &amp;amp;#38; CEO&amp;lt;br /&amp;gt;G&amp;amp;#233;om&amp;amp;#233;ga&amp;lt;br /&amp;gt;514-223-1449 ext. 3&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:kmugerman@Geomega.ca&amp;quot;&amp;gt;kmugerman@G&amp;amp;#233;om&amp;amp;#233;ga.ca&amp;lt;br /&amp;gt;&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;Nancy Thompson&amp;lt;br /&amp;gt;Vorticom Public Relations&amp;lt;br /&amp;gt;212-532-2208&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:nancyt@vorticom.com&amp;quot;&amp;gt;nancyt@vorticom.com&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;Twitter: @G&amp;amp;#233;om&amp;amp;#233;ga_REE&amp;lt;/p&amp;gt;&amp;lt;/div&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Mises en garde concernant les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs &amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;La Bourse de croissance TSX et son fournisseur de services de r&amp;amp;#233;glementation (au sens attribu&amp;amp;#233; &amp;amp;#224; ce terme dans les politiques de la Bourse de croissance TSX) n&amp;#x27;assument aucune responsabilit&amp;amp;#233; &amp;amp;#224; l&amp;#x27;&amp;amp;#233;gard de la pertinence ou de l&amp;#x27;exactitude du pr&amp;amp;#233;sent communiqu&amp;amp;#233;.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;Ce communiqu&amp;amp;#233; de presse peut contenir de l&amp;#x27;information prospective ou des &amp;amp;#233;nonc&amp;amp;#233;s prospectifs au sens des lois sur les valeurs mobili&amp;amp;#232;res canadiennes applicables. L&amp;#x27;information prospective et les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs peuvent inclure entre autres, des &amp;amp;#233;nonc&amp;amp;#233;s relatifs aux projets, les co&amp;amp;#251;ts, les objectifs et la performance de la Soci&amp;amp;#233;t&amp;amp;#233;, ou des hypoth&amp;amp;#232;ses relatives &amp;amp;#224; ce qui pr&amp;amp;#233;c&amp;amp;#232;de. Dans ce communiqu&amp;amp;#233; de presse, les termes comme &amp;amp;#171; pouvoir &amp;amp;#187;, &amp;amp;#171; croire &amp;amp;#187;, &amp;amp;#171; s&amp;#x27;attendre &amp;amp;#224; &amp;amp;#187;, &amp;amp;#171; avoir l&amp;#x27;intention &amp;amp;#187;, &amp;amp;#171; planifier &amp;amp;#187;, &amp;amp;#171; pr&amp;amp;#233;voir &amp;amp;#187;, &amp;amp;#171; potentiel &amp;amp;#187;, &amp;amp;#171; projets &amp;amp;#187;, &amp;amp;#171; estimer &amp;amp;#187;, &amp;amp;#171; continuer &amp;amp;#187;, ou des variantes ou des formes n&amp;amp;#233;gatives de tels termes ou encore d&amp;#x27;une terminologie comparable, sont utilis&amp;amp;#233;s pour identifier des &amp;amp;#233;nonc&amp;amp;#233;s prospectifs. Les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs ne devraient pas &amp;amp;#234;tre interpr&amp;amp;#233;t&amp;amp;#233;s comme une garantie des rendements ou r&amp;amp;#233;sultats futurs, et ne devraient pas n&amp;amp;#233;cessairement donner des indications pr&amp;amp;#233;cises concernant le moment qu&amp;#x27;un tel rendement pourra &amp;amp;#234;tre r&amp;amp;#233;alis&amp;amp;#233;. Rien ne garantit que les &amp;amp;#233;v&amp;amp;#232;nements pr&amp;amp;#233;vus dans l&amp;#x27;information prospective de ce communiqu&amp;amp;#233; de presse se concr&amp;amp;#233;tiseront, y compris la commercialisation des technologies mentionn&amp;amp;#233;es ci-dessus, ou, si l&amp;#x27;un ou l&amp;#x27;autre de ces &amp;amp;#233;v&amp;amp;#232;nements se concr&amp;amp;#233;tisent, quels seront les avantages que la Soci&amp;amp;#233;t&amp;amp;#233; en tirera. L&amp;#x27;information prospective et les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs sont bas&amp;amp;#233;s sur l&amp;#x27;information disponible au moment de la diffusion de ce communiqu&amp;amp;#233; de presse et/ou sur les pr&amp;amp;#233;visions faites de bonne foi par la direction, sous r&amp;amp;#233;serve des incertitudes, hypoth&amp;amp;#232;ses et autres facteurs pr&amp;amp;#233;vus ou non dont plusieurs sont ind&amp;amp;#233;pendants de la volont&amp;amp;#233; de la Soci&amp;amp;#233;t&amp;amp;#233;. Ces risques, incertitudes et hypoth&amp;amp;#232;ses incluent sans s&amp;#x27;y limiter, ceux d&amp;amp;#233;crits &amp;amp;#224; la rubrique portant sur les facteurs de risque de la notice annuelle de la Soci&amp;amp;#233;t&amp;amp;#233;, pour l&amp;#x27;exercice termin&amp;amp;#233; le 31 mai 2025, y compris la disponibilit&amp;amp;#233; de mati&amp;amp;#232;res premi&amp;amp;#232;res provenant de tierces parties raisonnablement disponibles pour l&amp;#x27;usine de d&amp;amp;#233;monstration, laquelle est disponible sur SEDAR+ &amp;amp;#224; l&amp;#x27;adresse www.sedarplus.ca; qui peuvent faire en sorte que les r&amp;amp;#233;sultats, le rendement ou les r&amp;amp;#233;sultats &amp;amp;#224; venir de la Soci&amp;amp;#233;t&amp;amp;#233; soient consid&amp;amp;#233;rablement diff&amp;amp;#233;rents de ceux indiqu&amp;amp;#233;s de fa&amp;amp;#231;on explicite ou implicite dans de tels &amp;amp;#233;nonc&amp;amp;#233;s prospectifs. La Soci&amp;amp;#233;t&amp;amp;#233; n&amp;#x27;entend pas ni ne s&amp;#x27;engage &amp;amp;#224; actualiser ou revoir l&amp;#x27;information prospective ou les &amp;amp;#233;nonc&amp;amp;#233;s prospectifs contenus dans ce communiqu&amp;amp;#233; de presse &amp;amp;#224; la lumi&amp;amp;#232;re de nouveaux renseignements, subs&amp;amp;#233;quents ou autres, sauf dans les cas pr&amp;amp;#233;vus par les lois applicables.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateNewsLogoContainer&amp;quot;&amp;gt;&amp;lt;img alt=&amp;quot;Corporate Logo&amp;quot; id=&amp;quot;corporateNewsLogo&amp;quot; src=&amp;quot;https://images.newsfilecorp.com/files/11749/265963_e91ffebaa453b9e8_logo.jpg&amp;quot; /&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateLinkBack&amp;quot;&amp;gt;To view the source version of this press release, please visit &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/ejqeRFDe4V&amp;quot;&amp;gt;https://www.newsfilecorp.com/release/265963&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;img height=&amp;quot;2&amp;quot; id=&amp;quot;352&amp;quot; src=&amp;quot;https://api.newsfilecorp.com/newsinfo/265963/352&amp;quot; style=&amp;quot;width: 1px; height: 1px; border: 0px solid;&amp;quot; width=&amp;quot;2&amp;quot; /&amp;gt;

(Source: Newsfile)</description>
    </item>
    <item>
      <title>Geomega Resources Inc. Provides Corporate Update</title>
      <link>https://www.newsfilecorp.com/release/265959/Geomega-Resources-Inc.-Provides-Corporate-Update</link>
      <guid>https://www.newsfilecorp.com/release/265959/Geomega-Resources-Inc.-Provides-Corporate-Update</guid>
      <pubDate>Thu, 11 Sep 2025 11:30:00 +0000</pubDate>
      <description>&amp;lt;p&amp;gt;Montreal, Quebec--(Newsfile Corp. - September 11, 2025) - Geomega Resources Inc.&amp;amp;#160;(TSXV: GMA) (OTCQB: GOMRF)&amp;amp;#160;(&amp;quot;&amp;lt;b&amp;gt;Geomega&amp;lt;/b&amp;gt;&amp;quot; or the &amp;quot;&amp;lt;b&amp;gt;Corporation&amp;lt;/b&amp;gt;&amp;quot;) is pleased to provide a corporate update with the following highlights:&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;Annual General and Special Meeting date set for October 22, 2025&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Upcoming change in Directors &amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Upcoming conferences&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Securities exercised&amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;Clarification on Montviel Qualified Person (QP)&amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Annual General and Special Meeting (AGM) 2025&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega Resources Inc. is pleased to announce that its AGM will take place on October 22, 2025, at 10:00 a.m. (Eastern Time) at the offices of Dentons Canada LLP, 1 Place Ville-Marie, 39th Floor, Montreal (Quebec), H3B 4M7. We look forward to meeting with our shareholders, sharing the Corporation&amp;#x27;s progress and future outlook, and engaging in meaningful discussions. Shareholders are invited to attend in person or via video conference. &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Shareholders who wish to attend the meeting virtually can register via the following &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/gJPeAHyKWg&amp;quot;&amp;gt;TEAMS meeting link&amp;lt;/a&amp;gt;. &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;We hope to see many of you join us on this occasion.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Change in Directors at Upcoming AGM&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega Resources Inc. is pleased to announce the nomination of Genevi&amp;amp;#232;ve Ayotte, CPA, to its Board of Directors. Ms. Ayotte, currently Chief Financial Officer of Arianne Phosphate Inc., will also assume the role of Chair of the Audit Committee. She brings extensive expertise in finance, accounting, governance and auditing, including more than 14 years with PricewaterhouseCoopers LLP, where she served as a Director in Audit in the firm&amp;#x27;s Montr&amp;amp;#233;al office and specialized in public and private companies in the mining sector. She also served as President of the Women in Mining Montr&amp;amp;#233;al chapter for over five years, through 2024.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;On this occasion, the Corporation also announces that Mr. Gilles Gingras, Director and Chair of the Audit Committee, will be retiring from the Board following 12 years of dedicated service. &amp;quot;On behalf of the Corporation, I wish to extend our sincere gratitude to Gilles for his leadership, commitment, and invaluable contributions to Geomega&amp;#x27;s development and success,&amp;quot; said Kiril Mugerman, President and CEO. &amp;quot;At the same time, we are very pleased to welcome Genevi&amp;amp;#232;ve as we continue to advance Geomega&amp;#x27;s growth strategy towards becoming a leading technology royalties company,&amp;quot; added Mugerman.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Upcoming Conferences &amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega is excited to announce that its management team will be attending and presenting at the upcoming conferences:&amp;lt;/p&amp;gt;&amp;lt;ul&amp;gt;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/ppoencqNm1&amp;quot;&amp;gt;ICSOBA 2025&amp;lt;/a&amp;gt; &amp;amp;#8211; The 43rd Conference and Exhibition of the International Committee for the Study of Bauxite, Alumina, and Aluminium will be held from October 26th to 31&amp;lt;sup&amp;gt;st&amp;lt;/sup&amp;gt;, 2025, in Nanning, Guangxi Province, China, where Geomega&amp;#x27;s Chief Technology Officer, Dr. Pouya Hajiani will be presenting on Waste to Value - Sustainable Valorization of Bauxite Residues. &amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/YE5V1sPaQm&amp;quot;&amp;gt;IFCURM 2025&amp;lt;/a&amp;gt; &amp;amp;#8211; The International Forum on Comprehensive Utilization of Bauxite Residue will be hosted from October 31&amp;lt;sup&amp;gt;st&amp;lt;/sup&amp;gt; to November 3&amp;lt;sup&amp;gt;rd&amp;lt;/sup&amp;gt;, 2025, in Nanning, Guangxi Province, China. At that event, Geomega and its partner Rio Tinto will be presenting on the work achieved as part of its critical and strategic minerals extraction from bauxite residues project. &amp;lt;/li&amp;gt;&amp;lt;li&amp;gt;&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/0p1qPc0ojY&amp;quot;&amp;gt;TMS 2026&amp;lt;/a&amp;gt; &amp;amp;#8211; The 155th annual meeting and exhibition for minerals, metals, and materials will be hosted from March 15 to 19, 2026, in San Diego, California, USA. At the event, Geomega&amp;#x27;s Chief Technology Officer, Dr. Pouya Hajiani will be presenting on its sustainable bauxite residues valorization technology. &amp;lt;/li&amp;gt;&amp;lt;/ul&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Exercise of Various Financial Instruments&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Since the beginning of the current fiscal year (June 1, 2025), the Corporation has raised over $735,060 through the exercise of various financial instruments (warrants and options) resulting in the issuance of a combined total of 5,354,667 common shares. Geomega continues to receive strong support from its largest shareholders as it advances its construction of the rare earths recycling demonstration plant and its R&amp;amp;#38;D program for bauxite residues valorization towards a licensing business model. &amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Clarification on Montviel Hydrometallurgical Work Press Release &amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega provided an update on Montviel hydrometallurgical process developments on June 17, 2025. Dr. Pouya Hajiani serves as the Corporation&amp;#x27;s Chief Technology Officer; however, he is not a Qualified Person (QP) as defined under Section 2.1 of National Instrument 43-101 &amp;amp;#8211; Standards of Disclosure for Mineral Projects. For further clarification, the Qualified Person responsible for reviewing and approving the scientific and technical information disclosed in the &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/RYwk1CKD73&amp;quot;&amp;gt;June 17, 2025 press release&amp;lt;/a&amp;gt; is Russell Boehme, P.Eng., who has reviewed and approved the information presented.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;About Geomega (&amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/WAg31TbqOy&amp;quot;&amp;gt;www.geomega.ca&amp;lt;/a&amp;gt;)&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega develops innovative technologies for extraction and separation of rare earth elements and other critical metals essential for a sustainable future. Geomega works with various feed streams to apply its technologies to waste valorization. This includes NdFeB magnet recycling, bauxite residue and sulphide tailings processing. Geomega&amp;#x27;s strategy revolves around gradually de-risking its innovative technology and delivering cashflow and return value to shareholders while working directly with the main players in their respective industries.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;As its technologies are demonstrated on larger scales, Geomega is committed to work with major partners to help extract value from mining feeds, tailings and other industrial residues which contain rare earths and other critical metals. Irrespective of the metal or the source, Geomega adopts a consistent approach to reduce the environmental impact and to contribute to lowering greenhouse gases emissions through recycling the major reagents in the process.&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;Geomega also owns the Montviel rare earth carbonatite deposit, the largest 43-101 bastnaesite resource estimate in North America and holds over 16.8M shares, representing approximately 13% of the issued and outstanding shares, of Kintavar Exploration Inc. (KTR.V), a mineral exploration company that is exploring for copper projects in Quebec, Canada.&amp;lt;/p&amp;gt;&amp;lt;div id=&amp;quot;contactInfo&amp;quot;&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;For further information, please contact:&amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p style=&amp;quot;margin-left: 20px;&amp;quot;&amp;gt;Kiril Mugerman&amp;lt;br /&amp;gt;President and CEO&amp;lt;br /&amp;gt;Geomega&amp;lt;br /&amp;gt;514-223-1449 ext. 3&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:kmugerman@geomega.ca&amp;quot;&amp;gt;kmugerman@geomega.ca&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p style=&amp;quot;margin-left: 20px;&amp;quot;&amp;gt;Nancy Thompson&amp;lt;br /&amp;gt;Vorticom Public Relations&amp;lt;br /&amp;gt;212-532-2208&amp;lt;br /&amp;gt;&amp;lt;a href=&amp;quot;mailto:nancyt@vorticom.com&amp;quot;&amp;gt;nancyt@vorticom.com&amp;lt;/a&amp;gt;&amp;lt;br /&amp;gt;Twitter: @Geomega_REE&amp;lt;/p&amp;gt;&amp;lt;/div&amp;gt;&amp;lt;p&amp;gt;&amp;lt;b&amp;gt;Cautions Regarding Forward-Looking Statements &amp;lt;/b&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p&amp;gt;&amp;lt;i&amp;gt;This news release contains statements that may constitute &amp;quot;forward-looking information&amp;quot; or &amp;quot;forward-looking statements&amp;quot; within the meaning of applicable Canadian securities legislation. Forward-looking information and statements may include, among others, statements regarding future plans, costs, objectives or performance of the Corporation, or the assumptions underlying any of the foregoing. In this news release, words such as &amp;quot;may&amp;quot;, &amp;quot;would&amp;quot;, &amp;quot;could&amp;quot;, &amp;quot;will&amp;quot;, &amp;quot;likely&amp;quot;, &amp;quot;believe&amp;quot;, &amp;quot;expect&amp;quot;, &amp;quot;anticipate&amp;quot;, &amp;quot;intend&amp;quot;, &amp;quot;plan&amp;quot;, &amp;quot;estimate&amp;quot; &amp;quot;target&amp;quot; and similar words and the negative form thereof are used to identify forward-looking statements. Forward-looking statements should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. No assurance can be given that any events anticipated by the forward-looking information will transpire or occur, including as regards the commercialization of any of the technology referred to above, or if any of them do so, what benefits the Corporation will derive. Forward-looking statements and information are based on information available at the time and/or management&amp;#x27;s good-faith belief with respect to future events and are subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Corporation&amp;#x27;s control. These risks, uncertainties and assumptions include, but are not limited to, those described under &amp;quot;Risk Factors&amp;quot; in the Corporation&amp;#x27;s annual management&amp;#x27;s discussion and analysis for the fiscal year ended May 31, 2025, which is available on SEDAR+ at &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/qpjencwykq&amp;quot;&amp;gt;www.sedarplus.ca&amp;lt;/a&amp;gt;; they could cause actual events or results to differ materially from those projected in any forward-looking statements. The Corporation does not intend, nor does the Corporation undertake any obligation, to update or revise any forward-looking information or statements contained in this news release to reflect subsequent information, events or circumstances or otherwise, except if required by applicable laws.&amp;lt;/i&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateNewsLogoContainer&amp;quot;&amp;gt;&amp;lt;img alt=&amp;quot;Corporate Logo&amp;quot; id=&amp;quot;corporateNewsLogo&amp;quot; src=&amp;quot;https://images.newsfilecorp.com/files/11749/265959_65e571af04391af6_logo.jpg&amp;quot; /&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;p id=&amp;quot;corporateLinkBack&amp;quot;&amp;gt;To view the source version of this press release, please visit &amp;lt;a href=&amp;quot;https://api.newsfilecorp.com/redirect/5WmoxuzADw&amp;quot;&amp;gt;https://www.newsfilecorp.com/release/265959&amp;lt;/a&amp;gt;&amp;lt;/p&amp;gt;&amp;lt;img height=&amp;quot;2&amp;quot; id=&amp;quot;352&amp;quot; src=&amp;quot;https://api.newsfilecorp.com/newsinfo/265959/352&amp;quot; style=&amp;quot;width: 1px; height: 1px; border: 0px solid;&amp;quot; width=&amp;quot;2&amp;quot; /&amp;gt;

(Source: Newsfile)</description>
    </item>
    <item>
      <title>Press Release Distribution and Management</title>
      <link>https://www.globenewswire.com/search/keyword/geomega</link>
      <guid>https://www.globenewswire.com/search/keyword/geomega</guid>
      <pubDate>Tue, 17 Jun 2025 11:30:00 +0000</pubDate>
      <description>GlobeNewswire specializes in the distribution and delivery of press releases, financial disclosures and multimedia content to the media and general public.

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Geomega provides update on Montviel hydrometallurgical process developments</title>
      <link>https://www.globenewswire.com/news-release/2025/06/17/3100544/0/en/Geomega-provides-update-on-Montviel-hydrometallurgical-process-developments.html</link>
      <guid>https://www.globenewswire.com/news-release/2025/06/17/3100544/0/en/Geomega-provides-update-on-Montviel-hydrometallurgical-process-developments.html</guid>
      <pubDate>Tue, 17 Jun 2025 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/2455d763-3298-4df7-ae51-f67b86505905&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;MONTREAL, June  17, 2025  (GLOBE NEWSWIRE) -- Geomega Resources Inc. (“Geomega” or the “Corporation”) (TSX.V: GMA) is pleased to provide an update on the...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Geomega provides update on rare earth magnet recycling demonstration plant</title>
      <link>https://www.globenewswire.com/news-release/2025/06/04/3093461/0/en/Geomega-provides-update-on-rare-earth-magnet-recycling-demonstration-plant.html</link>
      <guid>https://www.globenewswire.com/news-release/2025/06/04/3093461/0/en/Geomega-provides-update-on-rare-earth-magnet-recycling-demonstration-plant.html</guid>
      <pubDate>Wed, 04 Jun 2025 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/2455d763-3298-4df7-ae51-f67b86505905&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;MONTREAL, June  04, 2025  (GLOBE NEWSWIRE) -- Geomega Resources Inc. (“Geomega” or the “Corporation”) (TSX.V: GMA) is pleased to provide an update on the...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Geomega and Rio Tinto provide update on bauxite residue valorization pilot</title>
      <link>https://www.globenewswire.com/news-release/2025/04/16/3062448/0/en/Geomega-and-Rio-Tinto-provide-update-on-bauxite-residue-valorization-pilot.html</link>
      <guid>https://www.globenewswire.com/news-release/2025/04/16/3062448/0/en/Geomega-and-Rio-Tinto-provide-update-on-bauxite-residue-valorization-pilot.html</guid>
      <pubDate>Wed, 16 Apr 2025 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/062e73bb-1b32-4cf2-ac1d-68b670e60b2f&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;MONTREAL, April  16, 2025  (GLOBE NEWSWIRE) -- Geomega Resources Inc. (“Geomega” or the “Corporation”) (TSX.V: GMA) is pleased to provide an update on the...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Geomega Closes $2M Convertible Debenture Financing</title>
      <link>https://www.globenewswire.com/news-release/2025/03/25/3048627/0/en/Geomega-Closes-2M-Convertible-Debenture-Financing.html</link>
      <guid>https://www.globenewswire.com/news-release/2025/03/25/3048627/0/en/Geomega-Closes-2M-Convertible-Debenture-Financing.html</guid>
      <pubDate>Tue, 25 Mar 2025 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/2455d763-3298-4df7-ae51-f67b86505905&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;MONTREAL, March  25, 2025  (GLOBE NEWSWIRE) -- Geomega Resources Inc. (“Geomega” or the “Corporation”) (TSX.V: GMA) is pleased to announce the...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Press Release Distribution and Management</title>
      <link>https://www.globenewswire.com/search/organization/Future%20Market%20Insights%20Global%20and%20Consulting%20Pvt%C2%A7%20Ltd%C2%A7</link>
      <guid>https://www.globenewswire.com/search/organization/Future%20Market%20Insights%20Global%20and%20Consulting%20Pvt%C2%A7%20Ltd%C2%A7</guid>
      <pubDate>Mon, 24 Mar 2025 14:30:00 +0000</pubDate>
      <description>GlobeNewswire specializes in the distribution and delivery of press releases, financial disclosures and multimedia content to the media and general public.

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Geomega Announces Annual Meeting Results and Grants Equity Awards</title>
      <link>https://www.globenewswire.com/news-release/2024/11/21/2985219/0/en/Geomega-Announces-Annual-Meeting-Results-and-Grants-Equity-Awards.html</link>
      <guid>https://www.globenewswire.com/news-release/2024/11/21/2985219/0/en/Geomega-Announces-Annual-Meeting-Results-and-Grants-Equity-Awards.html</guid>
      <pubDate>Thu, 21 Nov 2024 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/2455d763-3298-4df7-ae51-f67b86505905&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;MONTREAL, Nov.  21, 2024  (GLOBE NEWSWIRE) -- Geomega Resources Inc. (“Geomega” or the “Corporation”) (TSX.V: GMA) is pleased to announce the approval by...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Magnet Recycling Demo Plant Update and Warrant Extension</title>
      <link>https://www.globenewswire.com/news-release/2024/10/29/2970703/0/en/Magnet-Recycling-Demo-Plant-Update-and-Warrant-Extension.html</link>
      <guid>https://www.globenewswire.com/news-release/2024/10/29/2970703/0/en/Magnet-Recycling-Demo-Plant-Update-and-Warrant-Extension.html</guid>
      <pubDate>Tue, 29 Oct 2024 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/2455d763-3298-4df7-ae51-f67b86505905&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;MONTREAL, Oct.  29, 2024  (GLOBE NEWSWIRE) -- Geomega Resources Inc. (“Geomega” or the “Corporation”) (TSX.V: GMA) (OTC: GOMRF), a developer of innovative...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Global Rare Earth Metals Market to Reach USD 16.1 Billion by 2034, Driven by Soaring Demand for Neodymium in EV Motors</title>
      <link>https://www.globenewswire.com/news-release/2024/10/10/2961292/0/en/Global-Rare-Earth-Metals-Market-to-Reach-USD-16-1-Billion-by-2034-Driven-by-Soaring-Demand-for-Neodymium-in-EV-Motors-FMI-Study.html</link>
      <guid>https://www.globenewswire.com/news-release/2024/10/10/2961292/0/en/Global-Rare-Earth-Metals-Market-to-Reach-USD-16-1-Billion-by-2034-Driven-by-Soaring-Demand-for-Neodymium-in-EV-Motors-FMI-Study.html</guid>
      <pubDate>Thu, 10 Oct 2024 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/915d2f9c-7dc6-40c7-995c-2ba168208baa&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;The United States rare earth metals market is projected to surge at a CAGR of 7.5% during the forecast period. This growth is especially demonstrated...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
    <item>
      <title>Geomega Announces Resignation of Director</title>
      <link>https://www.globenewswire.com/news-release/2024/06/12/2897479/0/en/Geomega-Announces-Resignation-of-Director.html</link>
      <guid>https://www.globenewswire.com/news-release/2024/06/12/2897479/0/en/Geomega-Announces-Resignation-of-Director.html</guid>
      <pubDate>Wed, 12 Jun 2024 00:00:00 +0000</pubDate>
      <description>&amp;lt;div&amp;gt;&amp;lt;img src=&amp;quot;https://ml.globenewswire.com/Resource/Download/2455d763-3298-4df7-ae51-f67b86505905&amp;quot; style=&amp;quot;width: 100%;&amp;quot; /&amp;gt;&amp;lt;div&amp;gt;MONTREAL, June  12, 2024  (GLOBE NEWSWIRE) -- Geomega Resources Inc. (“Geomega” or the “Corporation”) (TSX.V: GMA) (OTC: GOMRF), a developer of clean...&amp;lt;/div&amp;gt;&amp;lt;/div&amp;gt;

(Source: GlobeNewswire)</description>
    </item>
  </channel>
</rss>